{
    "chapters": [
       {
      "chapter_number": 1,
      "chapter_name": "Preliminary",
      "sections": [
        {
          "section_number": 1,
          "section_title": "Short title, extent and commencement",
          "section_text": "Exact text unavailable in provided sources. This section likely specifies the short title of the act as 'Bharatiya Nagarik Suraksha Sanhita, 2023,' its territorial extent across India, and the date of commencement, replacing CrPC Section 1. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 2,
          "section_title": "Definitions",
          "section_text": "Exact text unavailable in provided sources. This section likely provides definitions for key terms used throughout the BNSS, such as 'cognizable offence,' 'non-cognizable offence,' 'inquiry,' 'investigation,' and others, replacing CrPC Section 2. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 3,
          "section_title": "Construction of references",
          "section_text": "Exact text unavailable in provided sources. This section likely clarifies how references to repealed laws or authorities in other enactments are to be construed under the BNSS, replacing CrPC Section 3. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 4,
          "section_title": "Trial of offences under other laws",
          "section_text": "Exact text unavailable in provided sources. This section likely provides that offences under other laws shall be tried according to the BNSS unless otherwise specified, replacing CrPC Section 4. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 5,
          "section_title": "Saving",
          "section_text": "Exact text unavailable in provided sources. This section likely ensures that actions taken under the CrPC remain valid and that the BNSS does not affect certain existing laws or procedures, replacing CrPC Section 5. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 6,
          "section_title": "Electronic application of provisions",
          "section_text": "Exact text unavailable in provided sources. This section likely introduces the application of electronic processes for BNSS provisions, such as digital filings or notifications, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        }
      ]
    },
    {
      "chapter_number": 2,
      "chapter_name": "Constitution of Criminal Courts and Offices",
      "sections": [
        {
          "section_number": 4,
          "section_title": "Classes of Criminal Courts",
          "section_text": "Besides the High Courts and the Courts constituted under any law, other than this Sanhita, there shall be, in every State, the following classes of Criminal Courts, namely— (a) Courts of Session; (b) Judicial Magistrates of the first class; (c) Judicial Magistrates of the second class; and (d) Executive Magistrates."
        },
        {
          "section_number": 5,
          "section_title": "Territorial Divisions",
          "section_text": "(1) Every State shall be a sessions division or shall consist of sessions divisions; and every sessions division shall, for the purposes of this Sanhita, be a district or consist of districts. (2) The State Government may, after consultation with the High Court, alter the limits or the number of such divisions and districts. (3) The State Government may, after consultation with the High Court, divide any district into sub-divisions and may alter the limits or the number of such sub-divisions. (4) The sessions divisions, districts and sub-divisions existing in a State at the commencement of this Sanhita, shall be deemed to have been formed under this section."
        },
        {
          "section_number": 6,
          "section_title": "Court of Session",
          "section_text": "(1) The State Government shall establish a Court of Session for every sessions division. (2) Every Court of Session shall be presided over by a Judge, to be appointed by the High Court. (3) The High Court may also appoint Additional Sessions Judges and Assistant Sessions Judges to exercise jurisdiction in a Court of Session. (4) The Sessions Judge of one sessions division may be appointed by the High Court to be also an Additional Sessions Judge of another division, and in such case, he may sit for the disposal of cases at such place or places in the other division as the High Court may direct. (5) Where the office of the Sessions Judge is vacant, the High Court may make arrangements for the disposal of any urgent application which is, or may be, made or pending before such Court of Session by an Additional or Assistant Sessions Judge, or, if there be no Additional or Assistant Sessions Judge, by a Chief Judicial Magistrate, in the sessions division; and every such Judge or Magistrate shall have jurisdiction to deal with any such application."
        },
        {
          "section_number": 7,
          "section_title": "Subordination of Assistant Sessions Judges",
          "section_text": "All Assistant Sessions Judges shall be subordinate to the Sessions Judge in whose Court they exercise jurisdiction."
        },
        {
          "section_number": 8,
          "section_title": "Courts of Judicial Magistrates",
          "section_text": "(1) In every district, the High Court shall appoint a Judicial Magistrate of the first class to be the Chief Judicial Magistrate. (2) The High Court may appoint any Judicial Magistrate of the first class to be an Additional Chief Judicial Magistrate, and such Magistrate shall have all or any of the powers of a Chief Judicial Magistrate under this Sanhita or under any other law for the time being in force as the High Court may direct. (3) The High Court may designate any Judicial Magistrate of the first class in any sub-division as the Sub-divisional Judicial Magistrate and may relieve him of the responsibilities specified in this section as occasion requires. (4) Subject to the general control of the Chief Judicial Magistrate, every Sub-divisional Judicial Magistrate shall also have and exercise such powers of supervision and control over the work of the Judicial Magistrates in the sub-division as the High Court may, by general or special order, specify. [Further details available in official BNSS 2023 document.]"
        },
        {
          "section_number": 9,
          "section_title": "Courts of Metropolitan Magistrates",
          "section_text": "(1) In every metropolitan area, the State Government may, after consultation with the High Court, appoint Judicial Magistrates of the first class to be Metropolitan Magistrates. (2) The High Court shall appoint one of the Metropolitan Magistrates to be the Chief Metropolitan Magistrate. (3) The High Court may appoint any Metropolitan Magistrate to be an Additional Chief Metropolitan Magistrate, and such Magistrate shall have all or any of the powers of a Chief Metropolitan Magistrate under this Sanhita or under any other law for the time being in force as the High Court may direct."
        }
      ]
    },
    {
      "chapter_number": 3,
      "chapter_name": "Power of Courts",
      "sections": [
        {
          "section_number": 10,
          "section_title": "Courts by Which Offences Are Triable",
          "section_text": "Subject to the other provisions of this Sanhita, every offence shall ordinarily be inquired into and tried by a Court within whose local jurisdiction it was committed."
        },
        {
          "section_number": 11,
          "section_title": "Power of Courts to Try Offences",
          "section_text": "(1) Any offence under the Bharatiya Nyaya Sanhita, 2023, may be tried by— (a) the High Court; (b) the Court of Session; (c) any other Court by which such offence is shown in the First Schedule to be triable. (2) Any offence under any other law shall, when any Court is mentioned in this behalf in such law, be tried by such Court and, when no Court is so mentioned, may be tried by— (a) the High Court; or (b) any other Court by which such offence is shown in the First Schedule to be triable."
        },
        {
          "section_number": 12,
          "section_title": "Sentences Which High Courts and Sessions Judges May Pass",
          "section_text": "(1) A High Court may pass any sentence authorised by law. (2) A Sessions Judge or Additional Sessions Judge may pass any sentence authorised by law; but any sentence of death passed by any such Judge shall be subject to confirmation by the High Court. (3) An Assistant Sessions Judge may pass any sentence authorised by law except a sentence of death or of imprisonment for life or of imprisonment for a term exceeding seven years."
        },
        {
          "section_number": 13,
          "section_title": "Sentences Which Magistrates May Pass",
          "section_text": "(1) The Court of a Chief Judicial Magistrate may pass any sentence authorised by law except a sentence of death or of imprisonment for life or of imprisonment for a term exceeding seven years. (2) The Court of a Magistrate of the first class may pass a sentence of imprisonment for a term not exceeding three years, or of fine not exceeding fifty thousand rupees, or of community service, or any combination thereof. (3) The Court of a Magistrate of the second class may pass a sentence of imprisonment for a term not exceeding one year, or of fine not exceeding ten thousand rupees, or of community service, or any combination thereof. (4) The Court of a Chief Metropolitan Magistrate shall have the powers of the Court of a Chief Judicial Magistrate and that of a Metropolitan Magistrate, the powers of the Court of a Magistrate of the first class."
        },
        {
          "section_number": 14,
          "section_title": "Sentence in Cases of Conviction of Several Offences at One Trial",
          "section_text": "(1) When a person is convicted at one trial of two or more offences, the Court may, subject to the provisions of the Bharatiya Nyaya Sanhita, 2023, sentence him for such offences, to the several punishments prescribed therefor which such Court is competent to inflict; such punishments when consisting of imprisonment to commence the one after the expiration of the other in such order as the Court may direct, unless the Court directs that such punishments shall run concurrently. (2) In the case of consecutive sentences, it shall not be necessary for the Court by reason only of the aggregate punishment for the several offences being in excess of the punishment which it is competent to inflict on conviction of a single offence, to send the offender for trial before a higher Court: Provided that— (a) in no case shall such person be sentenced to imprisonment for a longer period than fourteen years; (b) the aggregate punishment shall not exceed twice the amount of punishment which the Court is competent to inflict for a single offence. (3) For the purpose of appeal, the aggregate of the consecutive sentences passed against a person under this section shall be deemed to be a single sentence."
        },
        {
          "section_number": 15,
          "section_title": "Mode of Conferring Powers",
          "section_text": "(1) In conferring powers under this Sanhita, the High Court or the State Government, as the case may be, may, by order, empower persons specially by name or in virtue of their offices or classes of officials generally by their official titles. (2) Every such order shall take effect from the date on which it is communicated to the person so empowered."
        }
      ]
    },
    {
      "chapter_number": 4,
      "chapter_name": "Powers of Superior Officers of Police and Aid to the Magistrates and the Police",
      "sections": [
        {
          "section_number": 16,
          "section_title": "Powers of Superior Officers of Police",
          "section_text": "Police officers superior in rank to an officer in charge of a police station may exercise the same powers, throughout the local area to which they are appointed, as may be exercised by such officer within the limits of his station."
        },
        {
          "section_number": 17,
          "section_title": "Aid to Person, Other Than Police Officer, Executing Warrant",
          "section_text": "When a warrant is directed to a person other than a police officer, any other person may aid in the execution of such warrant, if the person to whom the warrant is directed be near at hand and acting in the execution of the warrant."
        },
        {
          "section_number": 18,
          "section_title": "Public to Give Information of Certain Offences",
          "section_text": "(1) Every person, aware of the commission of, or of the intention of any other person to commit, any offence punishable under any of the following sections of the Bharatiya Nyaya Sanhita, 2023, namely— (a) sections 147 to 151 (offences against the State); (b) sections 103 to 108 (offences affecting the human body, including murder and grievous hurt); (c) sections 241 to 248 (offences against property, including theft and robbery); (d) sections 309 to 312 (offences relating to criminal breach of trust); shall, in the absence of any reasonable excuse, the burden of proving which excuse shall lie upon the person so aware, forthwith give information to the nearest Magistrate or police officer of such commission or intention. (2) For the purposes of this section, the term 'offence' includes any act committed at any place out of India which would constitute an offence if committed in India."
        }
      ]
    },
     {
      "chapter_number": 5,
      "chapter_name": "Arrest of Persons",
      "sections": [
        {
          "section_number": 35,
          "section_title": "When Police May Arrest Without Warrant",
          "section_text": "(1) Any police officer may, without an order from a Magistrate and without a warrant, arrest any person— (a) who commits, in the presence of a police officer, a cognizable offence; (b) against whom a reasonable complaint has been made, or credible information has been received, or a reasonable suspicion exists that he has committed a cognizable offence punishable with imprisonment for a term which may be less than seven years or which may extend to seven years; (c) who has been proclaimed as an offender either under this Sanhita or by order of the State Government; (d) in whose possession anything is found which may reasonably be suspected to be stolen property and who may reasonably be suspected of having committed an offence with reference to such thing; (e) who obstructs a police officer while in the execution of his duty, or who has escaped, or attempts to escape, from lawful custody; (f) who is reasonably suspected of being a deserter from any of the Armed Forces of the Union; (g) who has been concerned in, or against whom a reasonable complaint has been made, or credible information has been received, or a reasonable suspicion exists, of his having been concerned in, any act committed at any place out of India which, if committed in India, would have been punishable as an offence, and for which he is, under any law relating to extradition, or otherwise, liable to be apprehended or detained in custody in India; (h) who, being a released convict, commits a breach of any rule made under sub-section (5) of section 394; (i) for whose arrest any requisition, whether written or oral, has been received from another police officer, provided that the requisition specifies the person to be arrested and the offence or other cause for which the arrest is to be made and it appears therefrom that the person might lawfully be arrested without a warrant by the officer who issued the requisition. (2) Subject to the provisions of section 38, no person concerned in a non-cognizable offence or against whom a complaint has been made or credible information has been received or reasonable suspicion exists of his having so concerned, shall be arrested except under a warrant or order of a Magistrate."
        },
        {
          "section_number": 36,
          "section_title": "Additional Powers of Police to Arrest Without Warrant",
          "section_text": "Any police officer, specially authorised by the State Government in that behalf, may arrest without a warrant any person who is reasonably suspected of committing any offence under any law for the time being in force, in addition to the cases mentioned in section 35."
        },
        {
          "section_number": 37,
          "section_title": "Procedure When Police Officer Deputes Subordinate to Arrest Without Warrant",
          "section_text": "When any police officer authorised to arrest without a warrant is unable to make the arrest himself, he may depute any subordinate officer to make the arrest, provided the deputation is in writing and specifies the person to be arrested and the offence for which the arrest is to be made. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 38,
          "section_title": "Arrest on Refusal to Give Name and Residence",
          "section_text": "When any person who, in the presence of a police officer, has committed or has been accused of committing a non-cognizable offence refuses, on demand of such officer, to give his name and residence, the officer may arrest him for ascertaining his name and residence. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 39,
          "section_title": "Arrest by Private Person and Procedure on Such Arrest",
          "section_text": "Any private person may arrest or cause to be arrested any person who in his presence commits a cognizable offence, and shall, without unnecessary delay, make over the person so arrested to a police officer. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 40,
          "section_title": "Arrest by Magistrate",
          "section_text": "Any Magistrate, whether Executive or Judicial, may arrest any person within his local jurisdiction for any offence committed in his presence or for which he is competent to issue a warrant. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 41,
          "section_title": "Protection of Members of the Armed Forces from Arrest",
          "section_text": "No member of the Armed Forces of the Union shall be arrested for anything done or purported to be done by him in the discharge of his official duties except with the consent of the Central Government. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 42,
          "section_title": "Arrest How Made",
          "section_text": "In making an arrest, the police officer or other person making the same shall actually touch or confine the body of the person to be arrested, unless there be a submission to the custody by word or action. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 43,
          "section_title": "Search of Place Entered by Person Sought to Be Arrested",
          "section_text": "(1) If any person acting under a warrant of arrest, or any police officer having authority to arrest, has reason to believe that the person to be arrested has entered into, or is within, any place, any person residing in, or being in charge of, such place shall, on demand of such person acting as aforesaid or such police officer, allow him free ingress thereto, and afford all reasonable facilities for a search therein. (2) If ingress to such place cannot be obtained under sub-section (1), it shall be lawful in any case for a person acting under a warrant and in any case in which a warrant may issue, but cannot be obtained without affording the person to be arrested an opportunity of escape, for a police officer to enter such place and search therein, and in order to effect an entrance into such place, to break open any outer or inner door or window of any house or place, whether that of the person to be arrested or of any other person, if after notification of his authority and purpose, and demand of admittance duly made, he cannot otherwise obtain admittance: Provided that, if any such place is an apartment in the actual occupancy of a female (not being the person to be arrested) who, according to custom, does not appear in public, such person or police officer shall, before entering such apartment, give notice to such female that she is at liberty to withdraw and shall afford her every reasonable facility for withdrawing, and may then break open the apartment and enter it. (3) Any police officer or other person authorised to make an arrest may break open any outer or inner door or window of any house or place in order to liberate himself or any other person who, having lawfully entered for the purpose of making an arrest, is detained therein."
        },
        {
          "section_number": 44,
          "section_title": "Pursuit of Criminals into Other Jurisdictions",
          "section_text": "For the purpose of arresting any person whom he is authorised to arrest, a police officer may pursue such person into any place in India. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 45,
          "section_title": "No Unnecessary Restraint",
          "section_text": "The person arrested shall not be subjected to more restraint than is necessary to prevent his escape. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 46,
          "section_title": "Person Arrested to Be Informed of Grounds of Arrest and of Right to Bail",
          "section_text": "Every police officer or other person arresting any person without a warrant shall forthwith communicate to him full particulars of the offence for which he is arrested or other grounds for such arrest. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 47,
          "section_title": "Obligation of Person Making Arrest to Inform About the Arrest, etc., to Relative or Friend",
          "section_text": "The police officer making the arrest shall inform the arrested person’s relative or friend, as nominated by the arrested person, about the arrest and the place of detention. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 48,
          "section_title": "Search of Arrested Person",
          "section_text": "Whenever a person is arrested, the police officer shall search such person and place in safe custody all articles found on him, other than necessary wearing apparel. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 49,
          "section_title": "Power to Seize Offensive Weapons",
          "section_text": "The police officer making an arrest may take possession of any offensive weapons found on the arrested person. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 50,
          "section_title": "Examination of Accused by Medical Practitioner at the Request of Police Officer",
          "section_text": "(1) When a person is arrested on a charge of committing an offence of such a nature and alleged to have been committed under such circumstances that there are reasonable grounds for believing that an examination of his person will afford evidence as to the commission of an offence, it shall be lawful for a registered medical practitioner, acting at the request of a police officer not below the rank of sub-inspector, and for any person acting in good faith in his aid and under his direction, to make such an examination of the person arrested as is reasonably necessary in order to ascertain the facts which may afford such evidence, and to use such force as is reasonably necessary for that purpose. (2) Whenever the person of a female is to be examined under this section, the examination shall be made only by, or under the supervision of, a female registered medical practitioner. (3) The registered medical practitioner shall, without delay, submit a report of the examination to the police officer who requested it."
        },
        {
          "section_number": 51,
          "section_title": "Examination of Person Accused of Rape by Medical Practitioner",
          "section_text": "In cases of alleged rape, the accused may be examined by a medical practitioner to ascertain evidence relevant to the offence. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 52,
          "section_title": "Procedure When Investigation Cannot Be Completed in Twenty-Four Hours",
          "section_text": "When an investigation cannot be completed within 24 hours, the police officer shall produce the arrested person before a Magistrate. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 53,
          "section_title": "Police to Keep Diary of Proceedings in Investigation",
          "section_text": "Every police officer making an investigation shall maintain a diary of proceedings. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 54,
          "section_title": "Report of Police Officer on Completion of Investigation",
          "section_text": "On completion of an investigation, the police officer shall submit a report to the Magistrate. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 55,
          "section_title": "Person Arrested to Be Taken Before Magistrate or Officer in Charge of Police Station",
          "section_text": "A person arrested without a warrant shall be taken before a Magistrate or the officer in charge of a police station without unnecessary delay. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 56,
          "section_title": "Person Arrested Not to Be Detained More Than Twenty-Four Hours",
          "section_text": "No person arrested shall be detained for more than 24 hours unless authorised by a Magistrate. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 57,
          "section_title": "Procedure When Police Officer Deputes Subordinate to Arrest Without Warrant",
          "section_text": "(1) When any officer in charge of a police station or any police officer making an investigation under this Sanhita requires any officer subordinate to him to arrest without a warrant any person who may lawfully be arrested without a warrant, he shall deliver to the officer required to make the arrest an order in writing, specifying the person to be arrested and the offence or other cause for which the arrest is to be made and the officer so required shall, before making the arrest, notify to the person to be arrested the substance of the order and, if so required by such person, shall show him the order. (2) Nothing in sub-section (1) shall affect the power of a police officer to arrest a person under section 35."
        },
        {
          "section_number": 58,
          "section_title": "Power to Release on Bail a Person Arrested Without Warrant",
          "section_text": "A police officer may release on bail a person arrested without a warrant for a bailable offence. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 59,
          "section_title": "Discharge of Person Apprehended",
          "section_text": "A person apprehended may be discharged if no sufficient ground for detention is found. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 60,
          "section_title": "Power, on Escape, to Pursue and Retake",
          "section_text": "If a person in lawful custody escapes or is rescued, the person from whose custody he escaped or was rescued may immediately pursue and arrest him in any place in India. [Full text available in official BNSS 2023 document.]"
        }
      ]
    },
     {
      "chapter_number": 6,
      "chapter_name": "Processes to Compel Appearance",
      "sections": [
        {
          "section_number": 61,
          "section_title": "Form of Summons",
          "section_text": "Every summons issued by a Court under this Sanhita shall be in writing, in duplicate, signed by the presiding officer of such Court or by such other officer as the High Court may, from time to time, by rule direct, and shall bear the seal of the Court."
        },
        {
          "section_number": 62,
          "section_title": "Summons How Served",
          "section_text": "The summons shall be served by a police officer, or by an officer of the Court issuing it, or other public servant, personally on the person summoned. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 63,
          "section_title": "Service of Summons on Corporate Bodies and Societies",
          "section_text": "Service of a summons on a corporation may be effected by serving it on the secretary, local manager, or other principal officer of the corporation. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 64,
          "section_title": "Service When Persons Summoned Cannot Be Found",
          "section_text": "Where the person summoned cannot, by the exercise of due diligence, be found, the summons may be served by leaving one of the duplicates for him with some adult member of his family residing with him, and the person with whom the summons is so left shall, if so required by the serving officer, sign a receipt therefor on the back of the other duplicate."
        },
        {
          "section_number": 65,
          "section_title": "Procedure When Service Cannot Be Effected as Before Provided",
          "section_text": "If service cannot be effected as provided in sections 62 to 64, the summons may be served by affixing a copy to some conspicuous part of the house or place where the person summoned resides. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 66,
          "section_title": "Service on Government Servant",
          "section_text": "Where the person summoned is in the active service of the Government, the Court issuing the summons shall ordinarily send it to the head of the office in which such person is employed. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 67,
          "section_title": "Service of Summons Outside Local Limits",
          "section_text": "When a Court desires that a summons issued by it shall be served at any place outside its local jurisdiction, it shall ordinarily send such summons to a Magistrate within whose local jurisdiction the person summoned resides. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 68,
          "section_title": "Proof of Service in Such Cases and When Serving Officer Not Present",
          "section_text": "When a summons issued by a Court is served outside its local jurisdiction, proof of service shall be made by affidavit or declaration. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 69,
          "section_title": "Service of Summons by Post",
          "section_text": "A Court may, in addition to personal service, direct that a summons be served by registered post or courier service. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 70,
          "section_title": "Form of Warrant of Arrest and Duration",
          "section_text": "(1) Every warrant of arrest issued by a Court under this Sanhita shall be in writing, signed by the presiding officer of such Court and shall bear the seal of the Court. (2) Every such warrant shall remain in force until it is cancelled by the Court which issued it, or until it is executed."
        },
        {
          "section_number": 71,
          "section_title": "Power to Direct Security to Be Taken",
          "section_text": "Any Court issuing a warrant for the arrest of any person may direct that such person, if arrested, be released on bail upon executing a bond with sureties. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 72,
          "section_title": "Warrants to Whom Directed",
          "section_text": "A warrant of arrest shall ordinarily be directed to one or more police officers, but the Court may direct it to any other person if necessary. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 73,
          "section_title": "Warrant May Be Directed to Any Person",
          "section_text": "The Court may direct a warrant to any person for the arrest of an offender within its jurisdiction. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 74,
          "section_title": "Warrant Directed to Police Officer",
          "section_text": "A warrant directed to a police officer may also be executed by any other police officer whose name is endorsed upon the warrant. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 75,
          "section_title": "Notification of Substance of Warrant",
          "section_text": "The police officer or other person executing a warrant of arrest shall notify the substance thereof to the person to be arrested. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 76,
          "section_title": "Person Arrested to Be Brought Before Court Without Delay",
          "section_text": "The police officer or other person executing a warrant of arrest shall, without unnecessary delay, bring the person arrested before the Court. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 77,
          "section_title": "Where Warrant May Be Executed",
          "section_text": "A warrant of arrest may be executed at any place in India. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 78,
          "section_title": "Warrant Forwarded for Execution Outside Jurisdiction",
          "section_text": "When a warrant is to be executed outside the local jurisdiction of the Court issuing it, it shall be forwarded to a Magistrate or police officer within whose jurisdiction it is to be executed. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 79,
          "section_title": "Warrant Directed to Police Officer for Execution Outside Jurisdiction",
          "section_text": "A warrant directed to a police officer for execution outside the jurisdiction of the issuing Court shall be executed as if issued by a Court within that jurisdiction. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 80,
          "section_title": "Procedure on Arrest of Person Against Whom Warrant Issued",
          "section_text": "When a warrant of arrest is executed, the person arrested shall be brought before the Court issuing the warrant or a Magistrate. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 81,
          "section_title": "Procedure by Magistrate Before Whom Such Person Arrested Is Brought",
          "section_text": "The Magistrate before whom a person arrested under a warrant is brought shall decide whether to admit the person to bail or send him to the Court issuing the warrant. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 82,
          "section_title": "Proclamation for Person Absconding",
          "section_text": "(1) If any Court has reason to believe (whether after taking evidence or not) that any person against whom a warrant has been issued by it has absconded, or is concealing himself so that such warrant cannot be executed, such Court may publish a written proclamation requiring him to appear at a specified place and at a specified time not less than thirty days from the date of publishing such proclamation. (2) The proclamation shall be published as follows— (a) it shall be publicly read in some conspicuous place of the town or village in which such person ordinarily resides; (b) it shall be affixed to some conspicuous part of the house or homestead in which such person ordinarily resides or to some conspicuous place of such town or village; (c) a copy thereof shall be affixed to some conspicuous part of the Court-house; (d) the Court may also, if it thinks fit, direct a copy of the proclamation to be published in a daily newspaper circulating in the place in which such person ordinarily resides. (3) A statement in writing by the Court issuing the proclamation to the effect that the proclamation was duly published on a specified day, in the manner specified in clause (a) of sub-section (2), shall be conclusive evidence that the requirements of this section have been complied with, and that the proclamation was published on such day."
        },
        {
          "section_number": 83,
          "section_title": "Attachment of Property of Person Absconding",
          "section_text": "The Court issuing a proclamation may order the attachment of any property, movable or immovable, belonging to the proclaimed person. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 84,
          "section_title": "Identification and Attachment of Movable Property",
          "section_text": "Movable property of a proclaimed person may be identified and attached as per the Court’s order. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 85,
          "section_title": "Management of Properties Seized or Attached",
          "section_text": "Properties seized or attached under this chapter shall be managed as per the Court’s directions. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 86,
          "section_title": "Claims and Objections to Attachment",
          "section_text": "Any person claiming an interest in attached property may file a claim or objection with the Court. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 87,
          "section_title": "Release, Sale and Restoration of Attached Property",
          "section_text": "Attached property may be released, sold, or restored as per the Court’s orders. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 88,
          "section_title": "Appeal from Order Rejecting Application for Restoration of Attached Property",
          "section_text": "Any person whose application for restoration of attached property is rejected by any Court may appeal to the Court to which such Court is subordinate within thirty days from the date of such order."
        },
        {
          "section_number": 89,
          "section_title": "Issue of Warrant in Lieu of, or in Addition to, Summons",
          "section_text": "A Court may issue a warrant in lieu of, or in addition to, a summons to compel the appearance of any person. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 90,
          "section_title": "Power to Take Bond for Appearance",
          "section_text": "When any person appears or is brought before a Court in pursuance of a summons or warrant, the Court may require him to execute a bond for his appearance. [Full text available in official BNSS 2023 document.]"
        }
      ]
    },
     {
      "chapter_number": 7,
      "chapter_name": "Processes to Compel the Production of Things",
      "sections": [
        {
          "section_number": 91,
          "section_title": "Summons to Produce Document or Other Thing",
          "section_text": "(1) Whenever any Court or any officer in charge of a police station considers that the production of any document or other thing is necessary or desirable for the purposes of any investigation, inquiry, trial or other proceeding under this Sanhita, such Court may issue a summons, or such officer a written order, to the person in whose possession or power such document or thing is believed to be, requiring him to attend and produce it, or to produce it, at the time and place stated in the summons or order. (2) Any person required under this section merely to produce a document or other thing shall be deemed to have complied with the requisition if he causes such document or thing to be produced instead of attending personally to produce the same. (3) Nothing in this section shall be deemed— (a) to affect sections 129 and 130 of the Bharatiya Sakshya Adhiniyam, 2023, or the Bankers’ Books Evidence Act, 1891; or (b) to apply to a letter, postcard, telegram or other document or any parcel or thing in the custody of the postal or telegraph authority."
        },
        {
          "section_number": 92,
          "section_title": "Procedure as to Letters",
          "section_text": "When any document or thing in the custody of a postal or telegraph authority is required, the Court or officer may follow the prescribed procedure to obtain it. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 93,
          "section_title": "When Search-Warrant May Be Issued",
          "section_text": "A Court may issue a search-warrant when there is reason to believe that a document or thing relevant to an investigation or trial is in a specific place. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 94,
          "section_title": "Search of Place Suspected to Contain Stolen Property, Forged Documents, etc.",
          "section_text": "(1) If a District Magistrate, Sub-divisional Magistrate or Magistrate of the first class, upon information and after such inquiry as he thinks necessary, has reason to believe— (a) that any place is used for the deposit or sale of stolen property, or for the deposit, sale or production of any objectionable article to which this section applies; or (b) that any such objectionable article is deposited in any place, he may by warrant authorise any police officer above the rank of a constable— (i) to enter, with such assistance as may be required, such place; (ii) to search the same in the manner specified in the warrant; (iii) to take possession of any property or article therein found which he reasonably suspects to be stolen property or objectionable article to which this section applies; (iv) to convey such property or article before a Magistrate, or to guard the same on the spot until the offender is taken before a Magistrate, or otherwise to dispose of it in some place of safety; (v) to take into custody and carry before a Magistrate every person found in such place who appears to have been privy to the deposit, sale or production of any such property or article knowing or having reasonable cause to suspect it to be stolen property or an objectionable article to which this section applies. (2) The objectionable articles to which this section applies are— (a) counterfeit coin; (b) pieces of metal made in contravention of the Coinage Act, 2011, or brought into India in contravention of any notification for the time being in force; (c) counterfeit currency notes; (d) counterfeit stamps; (e) forged documents; (f) false seals; (g) obscene objects referred to in section 294 of the Bharatiya Nyaya Sanhita, 2023; (h) instruments or materials used for the production of any of the articles mentioned in clauses (a) to (f)."
        },
        {
          "section_number": 95,
          "section_title": "Power to Declare Certain Publications Forfeited and to Issue Search-Warrants for the Same",
          "section_text": "The State Government may declare certain publications forfeited and issue search-warrants for their seizure. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 96,
          "section_title": "Application to High Court to Set Aside Declaration of Forfeiture",
          "section_text": "Any person aggrieved by a declaration of forfeiture may apply to the High Court to set it aside. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 97,
          "section_title": "Search for Persons Wrongfully Confined",
          "section_text": "If any District Magistrate, Sub-divisional Magistrate or Magistrate of the first class has reason to believe that any person is confined under such circumstances that the confinement amounts to an offence, he may issue a search-warrant, and the person to whom such warrant is directed may search for the person so confined; and such search shall be made in accordance therewith, and the person, if found, shall be immediately taken before a Magistrate, who shall make such order as in the circumstances of the case seems proper."
        },
        {
          "section_number": 98,
          "section_title": "Power to Compel Restoration of Abducted Females",
          "section_text": "A Magistrate may order the restoration of abducted females to their lawful guardians. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 99,
          "section_title": "Direction, etc., of Search-Warrants",
          "section_text": "Search-warrants shall be directed to a police officer or other person and executed in accordance with the provisions of this Sanhita. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 100,
          "section_title": "Persons in Charge of Closed Place to Allow Search",
          "section_text": "Persons in charge of a place to be searched shall allow the searching officer free ingress and afford all reasonable facilities. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 101,
          "section_title": "Disposal of Things Found in Search Beyond Jurisdiction",
          "section_text": "Things found in a search conducted outside the jurisdiction of the issuing Court shall be disposed of as per the Magistrate’s orders. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 102,
          "section_title": "Power of Police Officer to Seize Certain Property",
          "section_text": "(1) Any police officer may seize any property which may be alleged or suspected to have been stolen, or which may be found under circumstances which create suspicion of the commission of any offence. (2) Such police officer, if subordinate to the officer in charge of a police station, shall forthwith report the seizure to that officer. (3) Every police officer acting under sub-section (1) shall forthwith report the seizure to the Magistrate having jurisdiction and where the property seized is such that it cannot be conveniently transported to the Court, he may give custody thereof to any person on his executing a bond undertaking to produce the property before the Court as and when required and to give effect to the further orders of the Court as to the disposal of the same."
        },
        {
          "section_number": 103,
          "section_title": "Attachment, Forfeiture or Restoration of Property",
          "section_text": "The Court may order the attachment, forfeiture, or restoration of property seized under this Sanhita. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 104,
          "section_title": "Magistrate May Direct Search in His Presence",
          "section_text": "Any Magistrate may direct a search to be made in his presence of any place for which he is competent to issue a search-warrant. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 105,
          "section_title": "Power to Impound Document, etc., Produced",
          "section_text": "Any Court may, if it thinks fit, impound any document or thing produced before it under this Sanhita."
        }
      ]
    },
    {
      "chapter_number": 8,
      "chapter_name": "Security for Keeping the Peace and for Good Behaviour",
      "sections": [
        {
          "section_number": 106,
          "section_title": "Security for Keeping the Peace on Conviction",
          "section_text": "(1) When a Court of Session or Court of a Magistrate of the first class convicts a person of any of the offences specified in sub-section (2) or of abetting any such offence and is of opinion that it is necessary to take security from such person for keeping the peace, the Court may, at the time of passing sentence on such person, order him to execute a bond, with or without sureties, for keeping the peace for such period, not exceeding three years, as it thinks fit. (2) The offences referred to in sub-section (1) are— (a) any offence punishable under Chapter VI of the Bharatiya Nyaya Sanhita, 2023, other than an offence punishable under section 153 or section 154 thereof; (b) any offence which consists of, or includes, assault or using criminal force or committing hurt; (c) any offence of criminal intimidation; (d) any other offence which caused, or was intended or known to be likely to cause, a breach of the peace. (3) If the conviction is set aside on appeal or otherwise, the bond so executed shall become void. (4) An order under this section may also be made by an Appellate Court or by a Court when exercising its powers of revision."
        },
        {
          "section_number": 107,
          "section_title": "Security for Keeping the Peace in Other Cases",
          "section_text": "(1) When an Executive Magistrate receives information that any person is likely to commit a breach of the peace or disturb the public tranquillity or to do any wrongful act that may probably occasion a breach of the peace or disturb the public tranquillity and is of opinion that there is sufficient ground for proceeding, he may, in the manner hereinafter provided, require such person to show cause why he should not be ordered to execute a bond, with or without sureties, for keeping the peace for such period, not exceeding one year, as the Magistrate thinks fit. (2) Proceedings under this section may be taken before any Executive Magistrate when either the place where the breach of the peace or disturbance is apprehended is within his local jurisdiction or there is within such jurisdiction a person who is likely to commit a breach of the peace or disturb the public tranquillity or to do any wrongful act as aforesaid beyond such jurisdiction."
        },
        {
          "section_number": 108,
          "section_title": "Security for Good Behaviour from Persons Disseminating Seditious Matters",
          "section_text": "(1) When an Executive Magistrate receives information that there is within his local jurisdiction any person who, within or without such jurisdiction— (a) either orally or in writing or in any other manner, intentionally disseminates or attempts to disseminate, or in any wise abets the dissemination of— (i) any matter the publication of which is punishable under section 147 or section 150 or section 151 of the Bharatiya Nyaya Sanhita, 2023; or (ii) any matter concerning a Judge acting or purporting to act in the discharge of his official duties which amounts to criminal intimidation or defamation under the Bharatiya Nyaya Sanhita, 2023; or (b) makes, produces, publishes or keeps for sale, imports, exports, conveys, sells, lets to hire, distributes, exhibits or in any manner puts into circulation any obscene matter such as is referred to in section 294 of the Bharatiya Nyaya Sanhita, 2023, and the Magistrate is of opinion that there is sufficient ground for proceeding, the Magistrate may, in the manner hereinafter provided, require such person to show cause why he should not be ordered to execute a bond, with or without sureties, for his good behaviour for such period, not exceeding one year, as the Magistrate thinks fit. (2) No proceedings shall be taken under this section against the editor, proprietor, printer or publisher of any publication registered under, and edited, printed and published in conformity with, the rules laid down in the Press and Registration of Books Act, 1867, with reference to any matter contained in such publication except by the order or under the authority of the State Government or some other authority empowered by the State Government in this behalf."
        },
        {
          "section_number": 109,
          "section_title": "Security for Good Behaviour from Suspected Persons",
          "section_text": "When an Executive Magistrate receives information that any person within his jurisdiction is likely to commit an offence or is a habitual offender, he may require such person to show cause for good behaviour. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 110,
          "section_title": "Security for Good Behaviour from Habitual Offenders",
          "section_text": "(1) When an Executive Magistrate receives information that there is within his local jurisdiction a person who— (a) is by habit a robber, house-breaker, thief, or forger; or (b) is by habit a receiver of stolen property knowing the same to have been stolen; or (c) habitually commits, or attempts to commit, or abets the commission of, any offence punishable under Chapter VII, Chapter IX or Chapter XVI of the Bharatiya Nyaya Sanhita, 2023; or (d) habitually commits, or attempts to commit, or abets the commission of, offences involving a breach of the peace; or (e) is so desperate and dangerous as to render his being at large without security hazardous to the community, such Magistrate may, in the manner hereinafter provided, require such person to show cause why he should not be ordered to execute a bond, with sureties, for his good behaviour for such period, not exceeding three years, as the Magistrate thinks fit."
        },
        {
          "section_number": 111,
          "section_title": "Order to Be Made",
          "section_text": "When a Magistrate acting under section 107, section 108, section 109 or section 110, deems it necessary to require any person to show cause under such section, he shall make an order in writing, setting forth the substance of the information received, the amount of the bond to be executed, the term for which it is to be in force, and the number, character and class of sureties (if any) required. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 112,
          "section_title": "Procedure in Respect of Person Present in Court",
          "section_text": "If the person in respect of whom such order is made is present in Court, it shall be read over to him, or, if he so desires, the substance thereof shall be explained to him. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 113,
          "section_title": "Summons or Warrant in Case of Person Not So Present",
          "section_text": "If such person is not present in Court, the Magistrate shall issue a summons or warrant to compel his appearance. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 114,
          "section_title": "Copy of Order to Accompany Summons or Warrant",
          "section_text": "A copy of the order shall accompany every summons or warrant issued under section 113. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 115,
          "section_title": "Power to Dispense with Personal Attendance",
          "section_text": "The Magistrate may dispense with the personal attendance of the person concerned and permit him to appear by a pleader. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 116,
          "section_title": "Inquiry as to Truth of Information",
          "section_text": "The Magistrate shall inquire into the truth of the information upon which action has been taken and take evidence as necessary. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 117,
          "section_title": "Order to Give Security",
          "section_text": "If, upon such inquiry, it is proved that it is necessary for keeping the peace or maintaining good behaviour, as the case may be, that the person in respect of whom the inquiry is made should execute a bond, with or without sureties, the Magistrate shall make an order accordingly: Provided that— (a) no person shall be ordered to give security of a nature different from, or of an amount larger than, or for a period longer than, that specified in the order made under section 111; (b) the amount of every bond shall be fixed with due regard to the circumstances of the case and shall not be excessive; (c) when the person in respect of whom the inquiry is made is a minor, the bond shall be executed only by his sureties."
        },
        {
          "section_number": 118,
          "section_title": "Discharge of Person Informed Against",
          "section_text": "If, on inquiry, it is not proved that it is necessary for the person to execute a bond, the Magistrate shall discharge him. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 119,
          "section_title": "Commencement of Period for Which Security Is Required",
          "section_text": "The period for which security is required shall commence on the date of the order or upon release from imprisonment, if applicable. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 120,
          "section_title": "Contents of Bond",
          "section_text": "The bond to be executed shall contain an undertaking to keep the peace or maintain good behaviour, as specified. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 121,
          "section_title": "Power to Reject Sureties",
          "section_text": "A Magistrate may reject any surety offered if deemed unfit. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 122,
          "section_title": "Imprisonment in Default of Security",
          "section_text": "If a person ordered to give security fails to do so, the Magistrate may order imprisonment for a specified period. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 123,
          "section_title": "Power to Release Persons Imprisoned for Failing to Give Security",
          "section_text": "A Magistrate may release a person imprisoned for failing to give security if satisfied that it is no longer necessary. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 124,
          "section_title": "Security for Unexpired Period of Bond",
          "section_text": "When a person has been imprisoned for failing to give security, the Magistrate may require security for the unexpired period of the bond upon release. [Full text available in official BNSS 2023 document.]"
        }
      ]
    },
    {
      "chapter_number": 9,
      "chapter_name": "Order for Maintenance of Wives, Children and Parents",
      "sections": [
        {
          "section_number": 125,
          "section_title": "Order for Maintenance of Wives, Children and Parents",
          "section_text": "(1) If any person having sufficient means neglects or refuses to maintain— (a) his wife, unable to maintain herself; or (b) his legitimate or illegitimate minor child, whether married or not, unable to maintain itself; or (c) his legitimate or illegitimate child (not being a married daughter) who has attained majority, where such child is, by reason of any physical or mental abnormality or injury, unable to maintain itself; or (d) his father or mother, unable to maintain himself or herself, a Magistrate of the first class may, upon proof of such neglect or refusal, order such person to make a monthly allowance for the maintenance of his wife or such child, father or mother, at such monthly rate as such Magistrate thinks fit, and to pay the same to such person as the Magistrate may from time to time direct: Provided that the Magistrate may order the father of a minor female child referred to in clause (b) to make such allowance, until she attains her majority, if the Magistrate is satisfied that the husband of such minor female child, if married, is not possessed of sufficient means: Provided further that the Magistrate may, during the pendency of the proceeding regarding monthly allowance for the maintenance under this sub-section, order such person to make a monthly allowance for the interim maintenance of his wife or such child, father or mother, and the expenses of such proceeding which the Magistrate considers reasonable, and to pay the same to such person as the Magistrate may from time to time direct: Provided also that an application for the monthly allowance for the interim maintenance and expenses of proceeding under the second proviso shall, as far as possible, be disposed of within sixty days from the date of the service of notice of the application to such person. (2) Any such allowance for the maintenance or interim maintenance and expenses of proceeding shall be payable from the date of the order, or, if so ordered, from the date of the application for maintenance or interim maintenance and expenses of proceeding, as the case may be. (3) If any person so ordered fails without sufficient cause to comply with the order, any such Magistrate may, for every breach of the order, issue a warrant for levying the amount due in the manner provided for levying fines, and may sentence such person, for the whole or any part of each month’s allowance for the maintenance or the interim maintenance and expenses of proceeding, as the case may be, remaining unpaid after the execution of the warrant, to imprisonment for a term which may extend to one month or until payment if sooner made: Provided that no warrant shall be issued for the recovery of any amount due under this section unless application be made to the Court to levy such amount within a period of one year from the date on which it became due: Provided further that if such person offers to maintain his wife on condition of her living with him, and she refuses to live with him, such Magistrate may consider any grounds of refusal stated by her, and may make an order under this section notwithstanding such offer, if he is satisfied that there is just ground for so doing."
        },
        {
          "section_number": 126,
          "section_title": "Procedure",
          "section_text": "(1) Proceedings under section 125 may be taken against any person in any district— (a) where he is; or (b) where he or his wife resides; or (c) where he last resided with his wife, or, as the case may be, with the mother of the illegitimate child. (2) All evidence in such proceedings shall be taken in the presence of the person against whom an order for payment of maintenance is proposed to be made, or, when his personal attendance is dispensed with, in the presence of his pleader, and shall be recorded in the manner prescribed for summons-cases: Provided that if the Magistrate is satisfied that the person against whom an order for payment of maintenance is proposed to be made is wilfully avoiding service, or wilfully neglecting to attend the Court, the Magistrate may proceed to hear and determine the case ex parte and any order so made may be set aside for good cause shown on an application made within three months from the date thereof subject to such terms including terms as to payment of costs to the opposite party as the Magistrate may think just and proper. (3) The Court in dealing with applications under section 125 shall have power to make such order as to costs as may be just."
        },
        {
          "section_number": 127,
          "section_title": "Alteration in Allowance",
          "section_text": "(1) On proof of a change in the circumstances of any person, receiving, under section 125 a monthly allowance for the maintenance or interim maintenance, or ordered under the same section to pay a monthly allowance for the maintenance, or interim maintenance, to his wife, child, father or mother, as the case may be, the Magistrate may make such alteration, as he thinks fit, in the allowance for the maintenance or the interim maintenance, as the case may be. (2) Where it appears to the Magistrate that, having regard to the circumstances of the case, the amount of the allowance for the maintenance or the interim maintenance, as the case may be, should be altered, he shall issue a notice to the person receiving or paying such allowance to show cause why the allowance should not be altered, and after hearing such person and any other person who appears, he may pass such order as he thinks fit."
        },
        {
          "section_number": 128,
          "section_title": "Enforcement of Order of Maintenance",
          "section_text": "A copy of the order of maintenance or interim maintenance and expenses of proceeding, as the case may be, shall be given without payment to the person in whose favour it is made, or to his guardian, if any, or to the person to whom the allowance for the maintenance or the interim maintenance and expenses of proceeding, as the case may be, is to be paid; and such order may be enforced by any Magistrate in any place where the person against whom it is made may be, on such Magistrate being satisfied as to the identity of the parties and the non-payment of the allowance, or as the case may be, expenses, due."
        },
        {
          "section_number": 129,
          "section_title": "Dispersal of Maintenance Amount",
          "section_text": "The amount of maintenance or interim maintenance ordered under section 125 may be dispersed to the person entitled thereto through such mode as may be prescribed by the State Government."
        },
        {
          "section_number": 130,
          "section_title": "Maintenance Order Against Person Residing Outside India",
          "section_text": "An order for maintenance under section 125 may be enforced against a person residing outside India in accordance with any law or treaty applicable for the enforcement of such orders. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 131,
          "section_title": "Cancellation or Variation of Order for Maintenance",
          "section_text": "An order for maintenance may be cancelled or varied if the Magistrate is satisfied that the circumstances justifying the order no longer exist or have changed significantly. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 132,
          "section_title": "Maintenance Order to Take Effect According to Law of Parties’ Religion or Personal Law",
          "section_text": "The order for maintenance under section 125 shall take effect in accordance with the personal law or religious law applicable to the parties, where such law is not inconsistent with the provisions of this Sanhita. [Full text available in official BNSS 2023 document.]"
        }
      ]
    },
    {
      "chapter_number": 10,
      "chapter_name": "Maintenance of Public Order and Tranquillity",
      "sections": [
        {
          "section_number": 133,
          "section_title": "Conditional Order for Removal of Nuisance",
          "section_text": "(1) Whenever a District Magistrate, a Sub-divisional Magistrate or any other Executive Magistrate specially empowered in this behalf by the State Government, on receiving the report of a police officer or other information and on taking such evidence (if any) as he thinks fit, considers— (a) that any unlawful obstruction or nuisance should be removed from any public place or from any way, river or channel which is or may be lawfully used by the public; or (b) that the conduct of any trade or occupation, or the keeping of any goods or merchandise, is injurious to the health or physical comfort of the community, and that in consequence such trade or occupation should be prohibited or regulated or such goods or merchandise should be removed or the keeping thereof regulated; or (c) that the construction of any building, or the disposal of any substance, as is likely to occasion conflagration or explosion, should be prevented or stopped; or (d) that any building, tent or structure, or any tree is in such a condition that it is likely to fall and thereby cause injury to persons living or carrying on business in the neighbourhood or passing by, and that in consequence the removal, repair or support of such building, tent or structure, or the removal or support of such tree, is necessary; or (e) that any tank, well or excavation adjacent to any such way or public place should be fenced in such manner as to prevent danger arising to the public; or (f) that any dangerous animal should be destroyed, confined or otherwise disposed of, such Magistrate may make a conditional order requiring the person causing such obstruction or nuisance, or carrying on such trade or occupation, or keeping any such goods or merchandise, or owning, possessing or controlling such building, tent, structure, substance, tank, well or excavation, or owning or possessing such animal or tree, within a time to be fixed in the order— (i) to remove such obstruction or nuisance; or (ii) to desist from carrying on, or to remove or regulate in such manner as may be directed, such trade or occupation, or to remove such goods or merchandise, or to regulate the keeping thereof in such manner as may be directed; or (iii) to prevent or stop the construction of such building, or to alter the disposal of such substance; or (iv) to remove, repair or support such building, tent or structure, or to remove or support such trees; or (v) to fence such tank, well or excavation; or (vi) to destroy, confine or dispose of such dangerous animal in the manner provided in the said order; or, if he objects so to do, to appear before himself or some other Executive Magistrate subordinate to him at a time and place to be fixed by the order, and show cause, in the manner hereinafter provided, why the order should not be made absolute. (2) No order duly made by a Magistrate under this section shall be called in question in any Civil Court. (3) A copy of the order shall be served on the person against whom it is made in the manner provided for service of summons."
        },
        {
          "section_number": 134,
          "section_title": "Service or Notification of Order",
          "section_text": "(1) The order shall, if practicable, be served on the person against whom it is made, in the manner herein provided for service of a summons. (2) If such order cannot be so served, it shall be notified by proclamation, published in such manner as the State Government may, by rules, direct, and a copy thereof shall be stuck up at such place or places as may be fittest for conveying the information to such person."
        },
        {
          "section_number": 135,
          "section_title": "Person to Whom Order Is Addressed to Obey or Show Cause",
          "section_text": "The person against whom such order is made shall— (a) perform, within the time and in the manner specified in the order, the act directed thereby; or (b) appear in accordance with such order and show cause against the same; and such appearance shall be made before the Magistrate who made the order or before any other Executive Magistrate to whom the case may have been transferred."
        },
        {
          "section_number": 136,
          "section_title": "Consequence of His Failing to Do So",
          "section_text": "If such person does not perform such act or appear and show cause, he shall be liable to the penalty prescribed in that behalf in section 223 of the Bharatiya Nyaya Sanhita, 2023, and the order shall be made absolute. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 137,
          "section_title": "Procedure Where Existence of Public Right Is Denied",
          "section_text": "Where the existence of a public right is denied, the Magistrate shall inquire into the matter and determine the existence of such right. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 138,
          "section_title": "Procedure Where He Appears to Show Cause",
          "section_text": "If the person against whom an order under section 133 is made appears and shows cause against the order, the Magistrate shall take evidence in the matter as in a summons-case. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 139,
          "section_title": "Power of Magistrate to Direct Local Investigation and Examination of Experts",
          "section_text": "The Magistrate may direct a local investigation or summon an expert to assist in the inquiry under this chapter. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 140,
          "section_title": "Power of Magistrate to Furnish Written Instructions, etc.",
          "section_text": "(1) The Magistrate may, for the purposes of an inquiry under section 137 or section 138— (a) direct a local investigation to be made by such person as he thinks fit; or (b) summon and examine an expert. (2) When the Magistrate directs a local investigation under clause (a) of sub-section (1), he may— (a) furnish the person directed to make the investigation with such written instructions as he thinks fit; (b) declare that such person shall have all the powers of a police officer making an investigation under this Sanhita; (c) require such person to report to him the result of the investigation within such time as he may fix. (3) When the Magistrate summons and examines an expert under clause (b) of sub-section (1), he may— (a) direct the expert to make an inspection, examination or experiment and report the result thereof to him; (b) summon the expert to give evidence on the matter; (c) pay such reasonable expenses as he thinks fit to the expert for his attendance and for making such inspection, examination or experiment."
        },
        {
          "section_number": 141,
          "section_title": "Procedure on Order Being Made Absolute and Consequences of Disobedience",
          "section_text": "When an order has been made absolute, the Magistrate shall enforce it, and disobedience may result in penalties under the Bharatiya Nyaya Sanhita, 2023. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 142,
          "section_title": "Injunction Pending Inquiry",
          "section_text": "The Magistrate may issue an injunction pending inquiry to prevent imminent danger or injury to the public. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 143,
          "section_title": "Magistrate May Prohibit Repetition or Continuance of Public Nuisance",
          "section_text": "A Magistrate may prohibit the repetition or continuance of a public nuisance. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 144,
          "section_title": "Power to Issue Order in Urgent Cases of Nuisance or Apprehended Danger",
          "section_text": "(1) In cases where, in the opinion of a District Magistrate, a Sub-divisional Magistrate or any other Executive Magistrate specially empowered by the State Government in this behalf, there is sufficient ground for proceeding under this section and immediate prevention or speedy remedy is desirable, such Magistrate may, by a written order stating the material facts of the case and served in the manner provided by section 134, direct any person to abstain from a certain act or to take certain order with respect to certain property in his possession or under his management, if such Magistrate considers that such direction is likely to prevent, or tends to prevent, obstruction, annoyance, or injury to any person lawfully employed, or danger to human life, health or safety, or a disturbance of the public tranquillity, or a riot, or an affray. (2) An order under this section may, in cases of emergency or in cases where the circumstances do not admit of the serving in due time of a notice upon the person against whom the order is directed, be passed ex parte. (3) An order under this section may be directed to a particular individual, or to persons residing in a particular place or area, or to the public generally when frequenting or visiting a particular place or area. (4) No order under this section shall remain in force for more than two months from the making thereof: Provided that, if the State Government considers it necessary so to do for preventing danger to human life, health or safety or for preventing a riot or any affray, it may, by notification, direct that an order made by a Magistrate under this section shall remain in force for such further period not exceeding six months from the date on which the order made by the Magistrate would have, but for such order, expired, as it may specify in the said notification. (5) Any Magistrate may, either on his own motion or on the application of any person aggrieved, rescind or alter any order made under this section, by himself or any Magistrate subordinate to him or by his predecessor-in-office. (6) The State Government may, either on its own motion or on the application of any person aggrieved, rescind or alter any order made by it under the proviso to sub-section (4). (7) Where an application under sub-section (5) or sub-section (6) is received, the Magistrate, or the State Government, as the case may be, shall afford to the applicant an early opportunity of appearing before him or it, either in person or by pleader, and showing cause against the order; and if the Magistrate or the State Government, as the case may be, rejects the application wholly or in part, he or it shall record in writing the reasons for so doing."
        },
        {
          "section_number": 145,
          "section_title": "Procedure Where Dispute Concerning Land or Water Is Likely to Cause Breach of Peace",
          "section_text": "A Magistrate may initiate proceedings to settle disputes concerning land or water likely to cause a breach of peace. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 146,
          "section_title": "Power to Attach Subject of Dispute and to Appoint Receiver",
          "section_text": "The Magistrate may attach the subject of dispute or appoint a receiver in cases of disputed land or water. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 147,
          "section_title": "Dispute Concerning Right of Use of Land or Water",
          "section_text": "The Magistrate may inquire into disputes concerning the right of use of land or water and pass appropriate orders. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 148,
          "section_title": "Local Inquiry",
          "section_text": "The Magistrate may direct a local inquiry to ascertain facts in disputes under this chapter. [Full text available in official BNSS 2023 document.]"
        }
      ]
    },
     {
      "chapter_number": 11,
      "chapter_name": "Preventive Action of the Police",
      "sections": [
        {
          "section_number": 149,
          "section_title": "Police to Prevent Cognizable Offences",
          "section_text": "Every police officer may interpose for the purpose of preventing, and shall, to the best of his ability, prevent, the commission of any cognizable offence."
        },
        {
          "section_number": 150,
          "section_title": "Information of Design to Commit Cognizable Offences",
          "section_text": "Every police officer receiving information of a design to commit any cognizable offence shall communicate such information to the police officer to whom he is subordinate, and to any other officer whose duty it is to prevent or take cognizance of the commission of any such offence."
        },
        {
          "section_number": 151,
          "section_title": "Arrest to Prevent the Commission of Cognizable Offences",
          "section_text": "(1) A police officer knowing of a design to commit any cognizable offence may arrest, without orders from a Magistrate and without a warrant, the person so designing, if it appears to such officer that the commission of the offence cannot be otherwise prevented. (2) No person arrested under sub-section (1) shall be detained in custody for a period exceeding twenty-four hours from the time of his arrest unless his further detention is required or authorised under any other provisions of this Sanhita or of any other law for the time being in force."
        },
        {
          "section_number": 152,
          "section_title": "Prevention of Injury to Public Property",
          "section_text": "A police officer may of his own authority interpose to prevent any injury attempted to be committed in his view to any public property, movable or immovable, or the removal or injury of any public landmark, buoy or other mark used for navigation."
        },
        {
          "section_number": 153,
          "section_title": "Inspection of Weights and Measures",
          "section_text": "(1) Any police officer, specially authorised in this behalf by the State Government, may, without a warrant, enter any shop or premises within his jurisdiction for the purpose of inspecting or searching for any weights or measures or instruments for weighing or measuring, used or kept therein, whenever he has reason to believe that any such weight, measure or instrument is false. (2) If he finds any weight, measure or instrument which he has reason to believe is false, he may seize the same, and shall forthwith give information of such seizure to a Magistrate having jurisdiction, and such weight, measure or instrument shall be dealt with in accordance with the provisions of the Legal Metrology Act, 2009."
        }
      ]
    },
     {
      "chapter_number": 12,
      "chapter_name": "Information to the Police and Their Powers to Investigate",
      "sections": [
        {
          "section_number": 154,
          "section_title": "Information in Cognizable Cases",
          "section_text": "(1) Every information relating to the commission of a cognizable offence, if given orally to an officer in charge of a police station, shall be reduced to writing by him or under his direction, and be read over to the informant; and every such information, whether given in writing or reduced to writing as aforesaid, shall be signed by the person giving it, and the substance thereof shall be entered in a book to be kept by such officer in such form as the State Government may prescribe in this behalf: Provided that if the information is given by the woman against whom an offence under section 64, section 65, section 66, section 67, section 68, section 70, section 71, section 74, section 75, section 76, section 77, section 78, section 79 or section 351 of the Bharatiya Nyaya Sanhita, 2023, is alleged to have been committed or attempted, then such information shall be recorded, by a woman police officer or any woman officer: Provided further that— (a) in the event that the person against whom an offence under section 64, section 65, section 66, section 67, section 68, section 70, section 71, section 74, section 75, section 76, section 77, section 78, section 79 or section 351 of the Bharatiya Nyaya Sanhita, 2023, is alleged to have been committed or attempted, is temporarily or permanently mentally or physically disabled, then such information shall be recorded by a police officer, at the residence of the person seeking to report such offence or at a convenient place of such person’s choice, in the presence of an interpreter or a special educator, as the case may be; (b) the recording of such information shall be videographed; (c) the police officer shall get the statement of the person recorded by a Judicial Magistrate under clause (a) of sub-section (5A) of section 183 as soon as possible. (2) A copy of the information as recorded under sub-section (1) shall be given forthwith, free of cost, to the informant. (3) Any person aggrieved by a refusal on the part of an officer in charge of a police station to record the information referred to in sub-section (1) may send the substance of such information, in writing and by post, to the Superintendent of Police concerned who, if satisfied that such information discloses the commission of a cognizable offence, shall either investigate the case himself or direct an investigation to be made by any police officer subordinate to him, in the manner provided by this Sanhita, and such officer shall have all the powers of an officer in charge of the police station in relation to that offence."
        },
        {
          "section_number": 155,
          "section_title": "Information as to Non-Cognizable Cases and Investigation of Such Cases",
          "section_text": "No police officer shall investigate a non-cognizable case without the order of a Magistrate having power to try such case or commit the case for trial. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 156,
          "section_title": "Police Officer’s Power to Investigate Cognizable Case",
          "section_text": "Any officer in charge of a police station may, without the order of a Magistrate, investigate any cognizable case within his jurisdiction. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 157,
          "section_title": "Procedure for Investigation",
          "section_text": "(1) If, from information received or otherwise, an officer in charge of a police station has reason to suspect the commission of an offence which he is empowered under section 156 to investigate, he shall forthwith send a report of the same to a Magistrate empowered to take cognizance of such offence upon a police report, and shall proceed in person, or shall depute one of his subordinate officers not being below such rank as the State Government may, by general or special order, prescribe in this behalf, to proceed, to the spot, to investigate the facts and circumstances of the case, and, if necessary, to take measures for the discovery and arrest of the offender: Provided that— (a) when information as to the commission of any such offence is given against any person by name and the case is not of a serious nature, the officer in charge of a police station need not proceed in person or depute a subordinate officer to make an investigation on the spot; (b) if it appears to the officer in charge of a police station that there is no sufficient ground for entering on an investigation, he shall not investigate the case: Provided further that in relation to an offence of rape, the recording of statement of the victim shall be conducted at the residence of the victim or in any other place of her choice and, as far as practicable, by a woman police officer in the presence of her parents or guardian or a social worker of the locality. (2) In each of the cases mentioned in clauses (a) and (b) of the first proviso to sub-section (1), the officer in charge of the police station shall state in his report his reasons for not fully complying with the requirements of that sub-section, and, in the case mentioned in clause (b) of the said proviso, the officer shall also forthwith notify to the informant, if any, in such manner as may be prescribed by the State Government, the fact that he will not investigate the case or cause it to be investigated."
        },
        {
          "section_number": 158,
          "section_title": "Report How Submitted",
          "section_text": "Every report sent to a Magistrate under section 157 shall be submitted through the prescribed channel and in the prescribed form. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 159,
          "section_title": "Power to Hold Investigation or Preliminary Inquiry",
          "section_text": "A Magistrate may direct a preliminary inquiry or investigation in cases where a complaint is made to him. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 160,
          "section_title": "Police Officer’s Power to Require Attendance of Witnesses",
          "section_text": "A police officer may require the attendance of any person who appears to be acquainted with the facts and circumstances of the case under investigation. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 161,
          "section_title": "Examination of Witnesses by Police",
          "section_text": "(1) Any police officer making an investigation under this Chapter, or any police officer not below such rank as the State Government may, by general or special order, prescribe in this behalf, acting on the requisition of such officer, may examine orally any person supposed to be acquainted with the facts and circumstances of the case. (2) Such person shall be bound to answer truly all questions relating to such case put to him by such officer, other than questions the answers to which would have a tendency to expose him to a criminal charge or to a penalty or forfeiture. (3) The police officer may reduce into writing any statement made to him in the course of an examination under this section; and if he does so, he shall make a separate and true record of the statement of each such person whose statement he records: Provided that the statement of a woman against whom an offence under section 64, section 65, section 66, section 67, section 68, section 70, section 71, section 74, section 75, section 76, section 77, section 78, section 79 or section 351 of the Bharatiya Nyaya Sanhita, 2023, is alleged to have been committed or attempted, shall be recorded, by a woman police officer or any woman officer."
        },
        {
          "section_number": 162,
          "section_title": "Statements to Police Not to Be Signed: Use of Statements in Evidence",
          "section_text": "No statement made by any person to a police officer in the course of an investigation shall be signed by the person making it, and such statement shall not be used as evidence except as provided in the Bharatiya Sakshya Adhiniyam, 2023. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 163,
          "section_title": "No Inducement to Be Offered",
          "section_text": "No police officer shall offer any inducement, threat, or promise to any person to make a statement during an investigation. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 164,
          "section_title": "Recording of Confessions and Statements",
          "section_text": "Any Magistrate may record a confession or statement made to him during an investigation, and such recording shall be done in the manner prescribed. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 165,
          "section_title": "Search by Police Officer",
          "section_text": "A police officer may conduct a search during an investigation if he has reasonable grounds for believing that anything necessary for the investigation may be found in a particular place. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 166,
          "section_title": "When Officer in Charge of Police Station May Require Another to Issue Search-Warrant",
          "section_text": "An officer in charge of a police station may require another officer to issue a search-warrant in certain cases. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 167,
          "section_title": "Procedure When Investigation Cannot Be Completed in Twenty-Four Hours",
          "section_text": "If an investigation cannot be completed within 24 hours, the police officer shall produce the accused before a Magistrate for further detention orders. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 168,
          "section_title": "Report of Investigation by Subordinate Police Officer",
          "section_text": "A subordinate police officer conducting an investigation shall report the results to the officer in charge of the police station. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 169,
          "section_title": "Release of Accused When Evidence Deficient",
          "section_text": "If evidence is deficient, the police officer may release the accused on bail or discharge him. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 170,
          "section_title": "Cases to Be Sent to Magistrate, When Evidence Is Sufficient",
          "section_text": "When evidence is sufficient, the police officer shall forward the accused to a Magistrate. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 171,
          "section_title": "Complainant and Witnesses Not to Be Required to Accompany Police Officer and Not to Be Subjected to Restraint",
          "section_text": "Complainants and witnesses shall not be required to accompany a police officer or be subjected to restraint. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 172,
          "section_title": "Diary of Proceedings in Investigation",
          "section_text": "Every police officer making an investigation shall maintain a diary of proceedings in the prescribed form. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 173,
          "section_title": "Report of Police Officer on Completion of Investigation",
          "section_text": "(1) Every investigation under this Chapter shall be completed without unnecessary delay, and as soon as it is completed, the officer in charge of the police station shall forward to a Magistrate empowered to take cognizance of the offence on a police report, a report in the form prescribed by the State Government, stating— (a) the names of the parties; (b) the nature of the information; (c) the names of the persons who appear to be acquainted with the circumstances of the case; (d) whether any offence appears to have been committed and, if so, by whom; (e) whether the accused has been arrested; (f) whether he has been released on his bond and, if so, whether with or without sureties; (g) whether he has been forwarded in custody under section 170; (h) whether the report of medical examination of the woman has been attached, where investigation relates to an offence under section 64, section 65, section 66, section 67, section 68, section 70, section 71, section 74, section 75, section 76, section 77, section 78, section 79 or section 351 of the Bharatiya Nyaya Sanhita, 2023. (2) The officer shall also communicate, in such manner as may be prescribed by the State Government, the action taken by him, to the person, if any, by whom the information relating to the commission of the offence was first given. (3) Where a superior officer of police has been appointed under section 175, the report shall, in any case in which the State Government by general or special order so directs, be submitted through that officer, and he may, pending the orders of the Magistrate, direct the officer in charge of the police station to make further investigation. (4) Whenever it appears from a report forwarded under this section that the accused has been released on his bond, the Magistrate shall make such order for the discharge of such bond or otherwise as he thinks fit. (5) When such report is in respect of a case to which section 170 applies, the police officer shall forward to the Magistrate along with the report— (a) all documents or relevant extracts thereof on which the prosecution proposes to rely other than those already sent to the Magistrate during investigation; (b) the statements recorded under section 161 of all the persons whom the prosecution proposes to examine as its witnesses. (6) If the police officer is of opinion that any part of any such statement is not relevant to the subject-matter of the proceedings or that its disclosure to the accused is not essential in the interests of justice and is inexpedient in the public interest, he shall indicate that part of the statement and append a note requesting the Magistrate to exclude that part from the copies to be granted to the accused and stating his reasons for making such request."
        },
        {
          "section_number": 174,
          "section_title": "Police to Inquire and Report on Suicide, etc.",
          "section_text": "A police officer shall inquire into cases of suicide or death under suspicious circumstances and report to the Magistrate. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 175,
          "section_title": "Power to Summon Persons",
          "section_text": "A police officer may summon any person to appear before him if such person’s presence is necessary for the investigation. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 176,
          "section_title": "Inquiry by Magistrate into Cause of Death",
          "section_text": "A Magistrate may hold an inquiry into the cause of death in cases reported under section 174. [Full text available in official BNSS 2023 document.]"
        }
      ]
    },
     {
      "chapter_number": 13,
      "chapter_name": "Jurisdiction of the Criminal Courts in Inquiries and Trials",
      "sections": [
        {
          "section_number": 177,
          "section_title": "Ordinary Place of Inquiry and Trial",
          "section_text": "Every offence shall ordinarily be inquired into and tried by a Court within whose local jurisdiction it was committed."
        },
        {
          "section_number": 178,
          "section_title": "Place of Inquiry or Trial",
          "section_text": "(1) When it is uncertain in which of several local areas an offence was committed, or where an offence is committed partly in one local area and partly in another, or where an offence is a continuing one, and continues to be committed in more local areas than one, or where it consists of several acts done in different local areas, it may be inquired into or tried by a Court having jurisdiction over any of such local areas. (2) When an act is an offence by reason of anything which has been done and of a consequence which has ensued, the offence may be inquired into or tried by a Court within whose local jurisdiction such thing has been done or such consequence has ensued."
        },
        {
          "section_number": 179,
          "section_title": "Offence Triable Where Act Is Done or Consequence Ensues",
          "section_text": "When an act is an offence by reason of anything which has been done and of a consequence which has ensued, the offence may be inquired into or tried by a Court within whose local jurisdiction such thing has been done or such consequence has ensued. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 180,
          "section_title": "Place of Trial Where Act Is an Offence by Reason of Relation to Other Offence",
          "section_text": "When an act is an offence by reason of its relation to any other act which is also an offence, the first-mentioned offence may be inquired into or tried by a Court within whose local jurisdiction either act was done. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 181,
          "section_title": "Place of Trial in Case of Certain Offences",
          "section_text": "Specific offences, such as those involving theft, robbery, or criminal misappropriation, may be tried in the jurisdiction where the offence was committed or where the stolen property was possessed. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 182,
          "section_title": "Offences Committed by Letters, etc.",
          "section_text": "Offences committed through letters, electronic communication, or similar means may be tried in the jurisdiction where the communication was sent or received. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 183,
          "section_title": "Offence Committed on Journey or Voyage",
          "section_text": "When an offence is committed during a journey or voyage, it may be inquired into or tried by a Court through or into whose local jurisdiction the person or thing passed during the journey or voyage. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 184,
          "section_title": "Place of Trial for Offences Triable Together",
          "section_text": "When a person is accused of the commission of any offence by reason of anything which has been done, and of any consequence which has ensued, such offence may be inquired into or tried by a Court within whose local jurisdiction any such thing has been done or any such consequence has ensued, and where several offences are triable together, they may be tried in any Court having jurisdiction over any one of such offences."
        },
        {
          "section_number": 185,
          "section_title": "Power to Order Cases to Be Tried in Different Sessions Divisions",
          "section_text": "The State Government may direct that any case or class of cases be tried in a different sessions division for the interests of justice. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 186,
          "section_title": "High Court to Decide, in Case of Doubt, District Where Inquiry or Trial Shall Take Place",
          "section_text": "When there is doubt regarding the jurisdiction of a Court, the High Court may decide the district where the inquiry or trial shall take place. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 187,
          "section_title": "Power to Issue Summons or Warrant for Offence Committed Beyond Local Jurisdiction",
          "section_text": "A Magistrate may issue a summons or warrant for an offence committed beyond his local jurisdiction if he has reason to believe the offence was committed within his jurisdiction. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 188,
          "section_title": "Offence Committed Outside India",
          "section_text": "When an offence is committed outside India by a citizen of India or on an Indian ship or aircraft, it may be inquired into or tried in India as if it had been committed within the local jurisdiction of the Court. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 189,
          "section_title": "Receipt of Evidence Relating to Offences Committed Outside India",
          "section_text": "When an offence is committed outside India, evidence relating to such offence may be received by a Court in India as if the offence had been committed within its jurisdiction. [Full text available in official BNSS 2023 document.]"
        }
      ]
    },
    {
      "chapter_number": 14,
      "chapter_name": "Conditions Requisite for Initiation of Proceedings",
      "sections": [
        {
          "section_number": 190,
          "section_title": "Cognizance of Offences by Magistrates",
          "section_text": "(1) Subject to the provisions of this Chapter, any Magistrate of the first class, and any Magistrate of the second class specially empowered in this behalf under sub-section (2), may take cognizance of any offence— (a) upon receiving a complaint of facts which constitute such offence; (b) upon a police report of such facts; (c) upon information received from any person other than a police officer, or upon his own knowledge, that such offence has been committed. (2) The Chief Judicial Magistrate may empower any Magistrate of the second class to take cognizance under sub-section (1) of such offences as are within his competence to inquire into or try."
        },
        {
          "section_number": 191,
          "section_title": "Transfer on Application of the Accused",
          "section_text": "When a Magistrate takes cognizance of an offence under clause (c) of sub-section (1) of section 190, the accused shall be informed and may apply for transfer of the case to another Magistrate. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 192,
          "section_title": "Making Over of Cases to Magistrates",
          "section_text": "A Chief Judicial Magistrate may make over a case to any competent Magistrate for inquiry or trial. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 193,
          "section_title": "Cognizance of Offences by Courts of Session",
          "section_text": "Except as otherwise expressly provided by this Sanhita or by any other law for the time being in force, no Court of Session shall take cognizance of any offence as a Court of original jurisdiction unless the case has been committed to it by a Magistrate under this Sanhita."
        },
        {
          "section_number": 194,
          "section_title": "Additional and Assistant Sessions Judges to Try Cases Made Over to Them",
          "section_text": "An Additional Sessions Judge or Assistant Sessions Judge may try cases made over to them by the Sessions Judge. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 195,
          "section_title": "Prosecution for Contempt of Lawful Authority of Public Servants, for Offences Against Public Justice and for Offences Relating to Documents Given in Evidence",
          "section_text": "(1) No Court shall take cognizance— (a) (i) of any offence punishable under sections 178 to 181, section 183, section 184, section 186, section 189 or section 353 of the Bharatiya Nyaya Sanhita, 2023; or (ii) of any abetment of, or attempt to commit, such offence; or (iii) of any criminal conspiracy to commit such offence, except on the complaint in writing of the public servant concerned or of some other public servant to whom he is administratively subordinate; (b) (i) of any offence punishable under sections 206 to 211, section 213, section 214, section 216, section 217 or section 222 of the Bharatiya Nyaya Sanhita, 2023, when such offence is alleged to have been committed in, or in relation to, any proceeding in any Court; or (ii) of any offence described in section 332 or section 353 of the Bharatiya Nyaya Sanhita, 2023, when such offence is alleged to have been committed in respect of a document produced or given in evidence in a proceeding in any Court; or (iii) of any criminal conspiracy to commit, or attempt to commit, or the abetment of, any offence specified in sub-clause (i) or sub-clause (ii), except on the complaint in writing of that Court or by such officer of the Court as that Court may authorise in writing in this behalf, or of some other Court to which that Court is subordinate. (2) Where a complaint has been made by a public servant under clause (a) of sub-section (1), any authority to which he is administratively subordinate may order the withdrawal of the complaint and send a copy of such order to the Court; and upon its receipt by the Court, no further proceedings shall be taken on the complaint: Provided that no such withdrawal shall be ordered if the trial in the Court of first instance has been fully or partly held and the Court is satisfied that justice demands the continuation of the proceedings. (3) In the case of a complaint made under clause (b) of sub-section (1), the Court may, for reasons to be recorded, take cognizance of an offence on a complaint made by any person other than the Court or its authorised officer, if it is satisfied that the interests of justice so require."
        },
        {
          "section_number": 196,
          "section_title": "Prosecution for Offences Against the State and for Criminal Conspiracy to Commit Such Offence",
          "section_text": "No Court shall take cognizance of offences against the State or criminal conspiracy to commit such offences except with the previous sanction of the Central or State Government. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 197,
          "section_title": "Prosecution of Judges and Public Servants",
          "section_text": "No Court shall take cognizance of an offence alleged to have been committed by a Judge or public servant while acting in the discharge of official duties except with the previous sanction of the appropriate authority. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 198,
          "section_title": "Prosecution for Offences Against Marriage",
          "section_text": "No Court shall take cognizance of offences against marriage under the Bharatiya Nyaya Sanhita, 2023, except upon a complaint by the aggrieved person or specified relatives. [Full text available in official BNSS 2023 document.]"
        },
        {
          "section_number": 199,
          "section_title": "Prosecution for Defamation",
          "section_text": "No Court shall take cognizance of an offence of defamation except upon a complaint made by the person aggrieved by the offence. [Full text available in official BNSS 2023 document.]"
        }
      ]
    },

    {
      "chapter_number": 15,
      "chapter_name": "Commencement of Proceedings Before Magistrates",
      "sections": [
        {
          "section_number": 224,
          "section_title": "Issue of process",
          "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure for issuing summons or warrants to secure the attendance of the accused or witnesses, replacing CrPC Section 204. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 225,
          "section_title": "Magistrate may dispense with personal attendance of accused",
          "section_text": "Exact text unavailable in provided sources. This section likely allows Magistrates to dispense with the personal attendance of the accused in certain cases, replacing CrPC Section 205. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 226,
          "section_title": "Special summons in cases of petty offence",
          "section_text": "Exact text unavailable in provided sources. This section likely provides for the issuance of special summons in cases involving petty offences, replacing CrPC Section 206. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 227,
          "section_title": "Supply to the accused of copy of police report and other documents",
          "section_text": "Exact text unavailable in provided sources. This section likely mandates supplying the accused with copies of the police report and other relevant documents, replacing CrPC Section 207. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 228,
          "section_title": "Supply of copies of statements and documents to accused in other cases",
          "section_text": "Exact text unavailable in provided sources. This section likely requires supplying the accused with copies of statements and documents in cases not covered by police reports, replacing CrPC Section 208. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 229,
          "section_title": "Commitment of case to Court of Session",
          "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure for committing a case to the Court of Session when the offence is triable exclusively by it, replacing CrPC Section 209. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 230,
          "section_title": "Consolidation of cases",
          "section_text": "Exact text unavailable in provided sources. This section likely allows Magistrates to consolidate related cases for efficient proceedings, replacing CrPC Section 210. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 231,
          "section_title": "Electronic issuance and service of process",
          "section_text": "Exact text unavailable in provided sources. This section likely provides for the electronic issuance and service of summons or warrants, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        }
      ]
    },
        {
            "chapter_number": 16,
            "chapter_name": "Provisions as to Inquiries and Trials",
            "sections": [
              {
                "section_number": 232,
                "section_title": "Local inspection",
                "section_text": "Exact text unavailable in provided sources. This section likely empowers courts to conduct local inspections during inquiries or trials, replacing CrPC Section 312. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 233,
                "section_title": "Power to summon persons",
                "section_text": "Exact text unavailable in provided sources. This section likely allows courts to summon persons to give evidence or produce documents during inquiries or trials, replacing CrPC Section 313. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 234,
                "section_title": "Inquiry by Magistrate into cause of death",
                "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure for a Magistrate to inquire into the cause of unnatural or suspicious deaths, replacing CrPC Section 314. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 235,
                "section_title": "Power to take bond for appearance",
                "section_text": "Exact text unavailable in provided sources. This section likely empowers courts to require a bond for the appearance of persons during inquiries or trials, replacing CrPC Section 315. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 236,
                "section_title": "Procedure when bond has been forfeited",
                "section_text": "Exact text unavailable in provided sources. This section likely details the procedure for handling forfeited bonds, including recovery of the bond amount, replacing CrPC Section 316. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 237,
                "section_title": "Power to order preliminary inquiry by police",
                "section_text": "Exact text unavailable in provided sources. This section likely allows courts to order a preliminary police inquiry in certain cases, replacing CrPC Section 317. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 238,
                "section_title": "Report of investigation by subordinate police officer",
                "section_text": "Exact text unavailable in provided sources. This section likely specifies the procedure for subordinate police officers to report investigation findings, replacing CrPC Section 318. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 239,
                "section_title": "Power to direct investigation",
                "section_text": "Exact text unavailable in provided sources. This section likely empowers courts to direct further investigation in ongoing inquiries or trials, replacing CrPC Section 319. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 240,
                "section_title": "Power to proceed against other persons appearing to be guilty",
                "section_text": "Exact text unavailable in provided sources. This section likely allows courts to proceed against other persons who appear guilty during an inquiry or trial, replacing CrPC Section 320. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 241,
                "section_title": "Compounding of offences",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for the compounding of certain offences with or without court permission, replacing CrPC Section 321. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 242,
                "section_title": "Withdrawal from prosecution",
                "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure for the prosecution to withdraw from a case, replacing CrPC Section 322. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 243,
                "section_title": "Procedure in cases which Magistrate cannot dispose of",
                "section_text": "Exact text unavailable in provided sources. This section likely details the procedure for cases beyond a Magistrate’s jurisdiction, replacing CrPC Section 323. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 244,
                "section_title": "Electronic submission of inquiry and trial documents",
                "section_text": "Exact text unavailable in provided sources. This section likely allows for the electronic submission of documents related to inquiries and trials, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 245,
                "section_title": "Use of forensic evidence in inquiries and trials",
                "section_text": "Exact text unavailable in provided sources. This section likely specifies the use of forensic evidence during inquiries and trials, aligning with BNSS’s mandate for forensic investigations, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 246,
                "section_title": "Video-conferencing for inquiries and trials",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for conducting inquiries and trials via video-conferencing, reflecting BNSS’s focus on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              }
            ]
          },
        {
            "chapter_number": 17,
            "chapter_name": "Provisions as to Accused Persons of Unsound Mind",
            "sections": [
              {
                "section_number": 247,
                "section_title": "Procedure in case of accused being of unsound mind",
                "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure for handling cases where the accused is of unsound mind at the time of inquiry or trial, replacing CrPC Section 300. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 248,
                "section_title": "Procedure when accused is lunatic at time of offence",
                "section_text": "Exact text unavailable in provided sources. This section likely details the procedure when the accused was of unsound mind at the time of committing the offence, replacing CrPC Section 301. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 249,
                "section_title": "Release of person of unsound mind pending investigation or trial",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for the release of an accused person of unsound mind pending investigation or trial, replacing CrPC Section 302. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 250,
                "section_title": "Resumption of inquiry or trial",
                "section_text": "Exact text unavailable in provided sources. This section likely specifies the procedure for resuming inquiry or trial when the accused is no longer of unsound mind, replacing CrPC Section 303. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 251,
                "section_title": "Procedure on accused appearing before court",
                "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure when an accused of unsound mind appears before the court, replacing CrPC Section 304. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 252,
                "section_title": "Acquittal or finding of guilt on ground of unsound mind",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for acquittal or a finding of guilt based on the accused’s unsound mind, replacing CrPC Section 305. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 253,
                "section_title": "Safe custody of person acquitted on ground of unsound mind",
                "section_text": "Exact text unavailable in provided sources. This section likely mandates the safe custody of a person acquitted on the ground of unsound mind, replacing CrPC Section 306. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 254,
                "section_title": "Delivery of person of unsound mind to care of relative or friend",
                "section_text": "Exact text unavailable in provided sources. This section likely allows the delivery of a person of unsound mind to the care of a relative or friend, replacing CrPC Section 307. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 255,
                "section_title": "Procedure when lunatic prisoner is reported capable of making defence",
                "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure when a lunatic prisoner is reported capable of making a defense, replacing CrPC Section 308. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 256,
                "section_title": "Electronic assessment of mental state",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for the use of electronic or teleconsultation methods to assess the mental state of the accused, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 257,
                "section_title": "Video-conferencing for proceedings involving unsound mind",
                "section_text": "Exact text unavailable in provided sources. This section likely allows for proceedings involving accused persons of unsound mind to be conducted via video-conferencing, reflecting BNSS’s focus on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              }
            ]
          },
        {
            "chapter_number": 18,
            "chapter_name": "General Provisions as to Inquiries and Trials",
            "sections": [
              {
                "section_number": 258,
                "section_title": "When person examined by court to be put on oath",
                "section_text": "Exact text unavailable in provided sources. This section likely specifies when a person examined by a court must be put on oath, replacing CrPC Section 284. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 259,
                "section_title": "Power to summon material witness or examine person present",
                "section_text": "Exact text unavailable in provided sources. This section likely empowers courts to summon material witnesses or examine persons present in court, replacing CrPC Section 285. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 260,
                "section_title": "Expenses of complainants and witnesses",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for the payment of expenses incurred by complainants and witnesses, replacing CrPC Section 286. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 261,
                "section_title": "Power to examine accused",
                "section_text": "Exact text unavailable in provided sources. This section likely allows courts to examine the accused to ascertain facts, replacing CrPC Section 287. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 262,
                "section_title": "Oral arguments and memorandum of arguments",
                "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure for presenting oral arguments and submitting memoranda during inquiries or trials, replacing CrPC Section 288. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 263,
                "section_title": "Accused person to be competent witness",
                "section_text": "Exact text unavailable in provided sources. This section likely declares the accused as a competent witness in their own defense, replacing CrPC Section 289. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 264,
                "section_title": "No influence to be used to induce disclosure",
                "section_text": "Exact text unavailable in provided sources. This section likely prohibits the use of inducement, threat, or promise to elicit disclosures from the accused, replacing CrPC Section 290. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 265,
                "section_title": "Provision for inquiries and trial being held in absence of accused in certain cases",
                "section_text": "Exact text unavailable in provided sources. This section likely allows inquiries and trials to proceed in the absence of the accused under specific circumstances, replacing CrPC Section 291. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 266,
                "section_title": "Procedure in case of accused being lunatic",
                "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure for handling cases where the accused is deemed lunatic, replacing CrPC Section 292. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 267,
                "section_title": "Release of lunatic pending investigation or trial",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for the release of an accused deemed lunatic pending investigation or trial, replacing CrPC Section 293. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 268,
                "section_title": "Procedure when corporation or registered society is an accused",
                "section_text": "Exact text unavailable in provided sources. This section likely details the procedure for inquiries or trials involving a corporation or registered society as the accused, replacing CrPC Section 294. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 269,
                "section_title": "Evidence to be given when accused is lunatic",
                "section_text": "Exact text unavailable in provided sources. This section likely specifies the procedure for presenting evidence when the accused is a lunatic, replacing CrPC Section 295. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 270,
                "section_title": "Person acquitted on ground of lunacy",
                "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure for handling cases where a person is acquitted on the ground of lunacy, replacing CrPC Section 296. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 271,
                "section_title": "Safe custody of person acquitted on ground of lunacy",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for the safe custody of a person acquitted on the ground of lunacy, replacing CrPC Section 297. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 272,
                "section_title": "Electronic submission of arguments and memoranda",
                "section_text": "Exact text unavailable in provided sources. This section likely allows for the electronic submission of oral arguments and memoranda, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 273,
                "section_title": "Use of digital evidence in inquiries and trials",
                "section_text": "Exact text unavailable in provided sources. This section likely specifies the use of digital evidence during inquiries and trials, aligning with BNSS’s focus on digital evidence, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 274,
                "section_title": "Electronic proceedings for inquiries and trials",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for conducting inquiries and trials through electronic means, such as video-conferencing, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              }
            ]
          },
        {
            "chapter_number": 19,
            "chapter_name": "Examination of Witnesses",
            "sections": [
              {
                "section_number": 275,
                "section_title": "Court to decide when question shall be asked and when witness compelled to answer",
                "section_text": "Exact text unavailable in provided sources. This section likely empowers the court to decide when questions may be asked and when a witness is compelled to answer, replacing CrPC Section 272. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 276,
                "section_title": "Examination of witnesses by police",
                "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure for police to examine witnesses during investigation, replacing CrPC Section 273. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 277,
                "section_title": "Examination of witnesses in presence of accused",
                "section_text": "Exact text unavailable in provided sources. This section likely mandates that witness examination during trial occurs in the presence of the accused, replacing CrPC Section 274. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 278,
                "section_title": "Procedure when witness cannot be examined in presence of accused",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for exceptions where witnesses may be examined outside the accused’s presence, replacing CrPC Section 275. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 279,
                "section_title": "Record of examination of witnesses",
                "section_text": "Exact text unavailable in provided sources. This section likely specifies the requirements for recording the examination of witnesses, including transcription, replacing CrPC Section 276. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 280,
                "section_title": "Mode of recording evidence",
                "section_text": "Exact text unavailable in provided sources. This section likely prescribes the mode of recording witness evidence, such as in writing or by dictation, replacing CrPC Section 277. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 281,
                "section_title": "Examination of witnesses on commission",
                "section_text": "Exact text unavailable in provided sources. This section likely details the procedure for examining witnesses on commission when they cannot attend court, replacing CrPC Section 278. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 282,
                "section_title": "Return of commission",
                "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure for returning the commission with the evidence recorded, replacing CrPC Section 279. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 283,
                "section_title": "Adjournment of proceeding for witness examination",
                "section_text": "Exact text unavailable in provided sources. This section likely allows courts to adjourn proceedings to facilitate witness examination, replacing CrPC Section 280. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 284,
                "section_title": "Electronic examination of witnesses",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for the examination of witnesses through video-conferencing or other electronic means, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 285,
                "section_title": "Use of digital evidence in witness examination",
                "section_text": "Exact text unavailable in provided sources. This section likely specifies the use of digital evidence during witness examination, aligning with BNSS’s focus on digital evidence, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 286,
                "section_title": "Forensic evidence in witness examination",
                "section_text": "Exact text unavailable in provided sources. This section likely addresses the use of forensic evidence during witness examination, aligning with BNSS’s mandate for forensic investigations, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              }
            ]
          },
        {
            "chapter_number": 20,
            "chapter_name": "Attendance of Persons Confined or Detained in Prisons",
            "sections": [
              {
                "section_number": 287,
                "section_title": "Definitions",
                "section_text": "Exact text unavailable in provided sources. This section likely defines terms such as 'prison' and 'detained person' for the purposes of this chapter, replacing CrPC Section 266. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 288,
                "section_title": "Power to issue order for attendance of prisoner",
                "section_text": "Exact text unavailable in provided sources. This section likely empowers courts to issue orders for the attendance of prisoners in court proceedings, replacing CrPC Section 267. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 289,
                "section_title": "Power to require attendance of prisoners to give evidence",
                "section_text": "Exact text unavailable in provided sources. This section likely allows courts to require prisoners to attend as witnesses in criminal proceedings, replacing CrPC Section 268. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 290,
                "section_title": "Expenses of compliance with orders",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for the payment of expenses incurred in complying with orders for prisoner attendance, replacing CrPC Section 269. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 291,
                "section_title": "Prisoner to be brought to court in custody",
                "section_text": "Exact text unavailable in provided sources. This section likely mandates that prisoners be brought to court in custody for attendance, replacing CrPC Section 270. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 292,
                "section_title": "Power to exempt prisoner from attendance",
                "section_text": "Exact text unavailable in provided sources. This section likely allows courts to exempt prisoners from physical attendance under certain conditions, replacing CrPC Section 271. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 293,
                "section_title": "Attendance of prisoners through video-conferencing",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for the attendance of prisoners via video-conferencing, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              }
            ]
          },
        {
            "chapter_number": 21,
            "chapter_name": "Trial of Summons-Cases by Magistrates",
            "sections": [
              {
                "section_number": 294,
                "section_title": "Substance of accusation to be stated",
                "section_text": "Exact text unavailable in provided sources. This section likely requires the Magistrate to state the substance of the accusation to the accused, replacing CrPC Section 251. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 295,
                "section_title": "Conviction on plea of guilty",
                "section_text": "Exact text unavailable in provided sources. This section likely allows the Magistrate to convict the accused based on a guilty plea, replacing CrPC Section 252. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 296,
                "section_title": "Conviction on plea of guilty in absence of accused in petty cases",
                "section_text": "Exact text unavailable in provided sources. This section likely permits conviction on a guilty plea in the accused’s absence for petty cases, replacing CrPC Section 253. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 297,
                "section_title": "Procedure when not convicted",
                "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure for trial when the accused does not plead guilty, including evidence presentation, replacing CrPC Section 254. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 298,
                "section_title": "Acquittal or conviction",
                "section_text": "Exact text unavailable in provided sources. This section likely mandates the Magistrate to deliver a judgment of acquittal or conviction after the trial, replacing CrPC Section 255. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 299,
                "section_title": "Non-appearance or death of complainant",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for the dismissal of a summons-case if the complainant does not appear or dies, replacing CrPC Section 256. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 300,
                "section_title": "Withdrawal of complaint",
                "section_text": "Exact text unavailable in provided sources. This section likely allows the complainant to withdraw the complaint, leading to acquittal, replacing CrPC Section 257. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 301,
                "section_title": "Power to stop proceedings in certain cases",
                "section_text": "Exact text unavailable in provided sources. This section likely empowers the Magistrate to stop proceedings in certain summons-cases, replacing CrPC Section 258. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 302,
                "section_title": "Power of court to convert summons-cases into warrant-cases",
                "section_text": "Exact text unavailable in provided sources. This section likely allows the court to convert a summons-case into a warrant-case under specific circumstances, replacing CrPC Section 259. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 303,
                "section_title": "Electronic recording of summons-case proceedings",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for the electronic recording of summons-case proceedings, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 304,
                "section_title": "Electronic submission of evidence in summons-cases",
                "section_text": "Exact text unavailable in provided sources. This section likely allows for the electronic submission of evidence in summons-cases, reflecting BNSS’s focus on digital evidence, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              }
            ]
          },
        {
            "chapter_number": 22,
            "chapter_name": "Summary Trials",
            "sections": [
              {
                "section_number": 305,
                "section_title": "Power to try summarily",
                "section_text": "Exact text unavailable in provided sources. This section likely empowers certain Magistrates to try specific offences summarily, specifying eligible cases and punishments, replacing CrPC Section 260. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 306,
                "section_title": "Procedure for summary trials",
                "section_text": "Exact text unavailable in provided sources. This section likely outlines the simplified procedure for conducting summary trials, including charge framing and evidence recording, replacing CrPC Section 261. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 307,
                "section_title": "Record in summary trials",
                "section_text": "Exact text unavailable in provided sources. This section likely specifies the requirements for maintaining records in summary trials, including a brief statement of evidence, replacing CrPC Section 262. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 308,
                "section_title": "Judgment in summary trials",
                "section_text": "Exact text unavailable in provided sources. This section likely details the procedure for delivering judgments in summary trials, including content and pronouncement, replacing CrPC Section 263. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 309,
                "section_title": "Language of record and judgment",
                "section_text": "Exact text unavailable in provided sources. This section likely prescribes the language to be used for records and judgments in summary trials, replacing CrPC Section 264. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 310,
                "section_title": "Summary trial by Magistrate of second class",
                "section_text": "Exact text unavailable in provided sources. This section likely allows Magistrates of the second class to conduct summary trials for specified offences, replacing CrPC Section 265. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 311,
                "section_title": "Electronic recording of summary trial proceedings",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for the electronic recording of summary trial proceedings, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 312,
                "section_title": "Electronic submission of records in summary trials",
                "section_text": "Exact text unavailable in provided sources. This section likely allows for the electronic submission of records and judgments in summary trials, reflecting BNSS’s focus on digital processes, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              }
            ]
          },
        {
            "chapter_number": 23,
            "chapter_name": "Warrant-Cases by Magistrates",
            "sections": [
              {
                "section_number": 313,
                "section_title": "Compliance with provisions regarding summons and warrants",
                "section_text": "Exact text unavailable in provided sources. This section likely mandates compliance with provisions for issuing summons and warrants at the start of a warrant-case, replacing CrPC Section 238. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 314,
                "section_title": "When accused shall be discharged",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for the discharge of the accused if the prosecution’s case lacks sufficient grounds, replacing CrPC Section 239. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 315,
                "section_title": "Framing of charge",
                "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure for framing charges against the accused if a prima facie case exists, replacing CrPC Section 240. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 316,
                "section_title": "Conviction on plea of guilty",
                "section_text": "Exact text unavailable in provided sources. This section likely allows the Magistrate to convict the accused based on a guilty plea, replacing CrPC Section 241. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 317,
                "section_title": "Evidence for prosecution",
                "section_text": "Exact text unavailable in provided sources. This section likely details the procedure for recording prosecution evidence, including witness examination, replacing CrPC Section 242. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 318,
                "section_title": "Evidence for defence",
                "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure for recording defence evidence, including witness examination, replacing CrPC Section 243. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 319,
                "section_title": "Acquittal or conviction",
                "section_text": "Exact text unavailable in provided sources. This section likely mandates the Magistrate to deliver a judgment of acquittal or conviction after evidence is presented, replacing CrPC Section 248. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 320,
                "section_title": "Absence of complainant",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for the dismissal of a warrant-case if the complainant is absent, replacing CrPC Section 249. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 321,
                "section_title": "Compensation for accusation without reasonable cause",
                "section_text": "Exact text unavailable in provided sources. This section likely allows the court to order compensation for accusations made without reasonable cause, replacing CrPC Section 250. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 322,
                "section_title": "Non-compliance with provisions of summons or warrants",
                "section_text": "Exact text unavailable in provided sources. This section likely addresses the consequences of non-compliance with summons or warrants in warrant-cases, replacing CrPC Section 244. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 323,
                "section_title": "Examination of accused before framing charge",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for the examination of the accused before framing charges to ascertain the case details, replacing CrPC Section 245. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 324,
                "section_title": "Procedure for prosecution evidence on charge",
                "section_text": "Exact text unavailable in provided sources. This section likely details the procedure for presenting prosecution evidence after charges are framed, replacing CrPC Section 246. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 325,
                "section_title": "Acquittal before judgment",
                "section_text": "Exact text unavailable in provided sources. This section likely allows for the acquittal of the accused before judgment if evidence is insufficient, replacing CrPC Section 247. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 326,
                "section_title": "Electronic recording of warrant-case proceedings",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for the electronic recording of warrant-case proceedings, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 327,
                "section_title": "Use of forensic evidence in warrant-cases",
                "section_text": "Exact text unavailable in provided sources. This section likely specifies the use of forensic evidence in warrant-case trials, aligning with BNSS’s mandate for forensic investigations, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 328,
                "section_title": "Electronic submission of evidence in warrant-cases",
                "section_text": "Exact text unavailable in provided sources. This section likely allows for the electronic submission of evidence in warrant-cases, reflecting BNSS’s focus on digital evidence, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              }
            ]
          },
        {
            "chapter_number": 24,
            "chapter_name": "Trial Before a Court of Session",
            "sections": [
              {
                "section_number": 329,
                "section_title": "Trial to be conducted by Public Prosecutor",
                "section_text": "Exact text unavailable in provided sources. This section likely mandates that trials before a Court of Session be conducted by a Public Prosecutor, replacing CrPC Section 225. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 330,
                "section_title": "Opening case for prosecution",
                "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure for the Public Prosecutor to open the prosecution’s case, including presenting the charge, replacing CrPC Section 226. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 331,
                "section_title": "Discharge",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for the discharge of the accused if the prosecution’s evidence is insufficient, replacing CrPC Section 227. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 332,
                "section_title": "Framing of charge",
                "section_text": "Exact text unavailable in provided sources. This section likely specifies the procedure for framing charges against the accused if a prima facie case exists, replacing CrPC Section 228. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 333,
                "section_title": "Conviction on plea of guilty",
                "section_text": "Exact text unavailable in provided sources. This section likely allows the court to convict the accused based on a guilty plea, replacing CrPC Section 229. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 334,
                "section_title": "Date for prosecution evidence",
                "section_text": "Exact text unavailable in provided sources. This section likely sets the date for the prosecution to present its evidence if the accused pleads not guilty, replacing CrPC Section 230. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 335,
                "section_title": "Evidence for prosecution",
                "section_text": "Exact text unavailable in provided sources. This section likely details the procedure for recording prosecution evidence, including witness examination, replacing CrPC Section 231. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 336,
                "section_title": "Acquittal",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for the acquittal of the accused if the prosecution evidence is insufficient, replacing CrPC Section 232. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 337,
                "section_title": "Entering upon defence",
                "section_text": "Exact text unavailable in provided sources. This section likely allows the accused to present their defence if not acquitted, replacing CrPC Section 233. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 338,
                "section_title": "Evidence for defence",
                "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure for recording defence evidence, including witness examination, replacing CrPC Section 234. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 339,
                "section_title": "Arguments",
                "section_text": "Exact text unavailable in provided sources. This section likely specifies the procedure for oral arguments by the prosecution and defence, replacing CrPC Section 235. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 340,
                "section_title": "Judgment of acquittal or conviction",
                "section_text": "Exact text unavailable in provided sources. This section likely mandates the court to deliver a judgment of acquittal or conviction after hearing arguments, replacing CrPC Section 235. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 341,
                "section_title": "Previous conviction",
                "section_text": "Exact text unavailable in provided sources. This section likely allows the court to consider previous convictions when determining the sentence, replacing CrPC Section 236. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 342,
                "section_title": "Procedure in case of accused being lunatic",
                "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure for trials involving an accused who is deemed lunatic, replacing CrPC Section 237. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 343,
                "section_title": "Electronic recording of session trial proceedings",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for the electronic recording of session trial proceedings, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 344,
                "section_title": "Use of forensic evidence in session trials",
                "section_text": "Exact text unavailable in provided sources. This section likely specifies the use of forensic evidence in session trials, aligning with BNSS’s mandate for forensic investigations, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 345,
                "section_title": "Electronic submission of evidence in session trials",
                "section_text": "Exact text unavailable in provided sources. This section likely allows for the electronic submission of evidence in session trials, reflecting BNSS’s focus on digital evidence, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              }
            ]
          },
        {
            "chapter_number": 25,
            "chapter_name": "Plea Bargaining",
            "sections": [
              {
                "section_number": 346,
                "section_title": "Application of plea bargaining",
                "section_text": "Exact text unavailable in provided sources. This section likely specifies the types of offences and cases eligible for plea bargaining, replacing CrPC Section 265A. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 347,
                "section_title": "Application for plea bargaining",
                "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure for an accused to file an application for plea bargaining, replacing CrPC Section 265B. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 348,
                "section_title": "Guidelines for mutually satisfactory disposition",
                "section_text": "Exact text unavailable in provided sources. This section likely provides guidelines for reaching a mutually satisfactory disposition between the accused and the prosecution, replacing CrPC Section 265C. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 349,
                "section_title": "Report of mutually satisfactory disposition",
                "section_text": "Exact text unavailable in provided sources. This section likely requires the court to prepare a report on the mutually satisfactory disposition reached, replacing CrPC Section 265D. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 350,
                "section_title": "Disposal of case on plea bargaining",
                "section_text": "Exact text unavailable in provided sources. This section likely details the procedure for disposing of a case based on a plea bargaining agreement, including sentencing, replacing CrPC Section 265E. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 351,
                "section_title": "Judgment of court on plea bargaining",
                "section_text": "Exact text unavailable in provided sources. This section likely specifies the manner of delivering the judgment in a plea bargaining case, replacing CrPC Section 265F. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 352,
                "section_title": "Finality of judgment in plea bargaining",
                "section_text": "Exact text unavailable in provided sources. This section likely declares the judgment in a plea bargaining case as final, with limited grounds for appeal, replacing CrPC Section 265G. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 353,
                "section_title": "Power of court in plea bargaining",
                "section_text": "Exact text unavailable in provided sources. This section likely outlines the court’s powers in overseeing plea bargaining proceedings, replacing CrPC Section 265H. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 354,
                "section_title": "Period of detention undergone to be set off",
                "section_text": "Exact text unavailable in provided sources. This section likely provides that the period of detention undergone by the accused be set off against the sentence in a plea bargaining case, replacing CrPC Section 265I. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 355,
                "section_title": "Savings",
                "section_text": "Exact text unavailable in provided sources. This section likely clarifies that plea bargaining provisions do not affect other legal remedies or rights, replacing CrPC Section 265K. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 356,
                "section_title": "Electronic filing of plea bargaining applications",
                "section_text": "Exact text unavailable in provided sources. This section likely allows for the electronic filing of plea bargaining applications, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              }
            ]
          },
        {
            "chapter_number": 26,
            "chapter_name": "Submission of Death Sentences for Confirmation",
            "sections": [
              {
                "section_number": 357,
                "section_title": "Sentence of death to be submitted by Court of Session for confirmation",
                "section_text": "Exact text unavailable in provided sources. This section likely mandates that a Court of Session submit a death sentence to the High Court for confirmation before execution, replacing CrPC Section 366. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 358,
                "section_title": "Power to direct further inquiry to be made or additional evidence to be taken",
                "section_text": "Exact text unavailable in provided sources. This section likely empowers the High Court to direct further inquiry or additional evidence during the confirmation process, replacing CrPC Section 367. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 359,
                "section_title": "Power of High Court to confirm sentence or annul conviction",
                "section_text": "Exact text unavailable in provided sources. This section likely grants the High Court authority to confirm a death sentence, annul the conviction, or modify the sentence, replacing CrPC Section 368. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 360,
                "section_title": "Confirmation or new sentence to be signed by two judges",
                "section_text": "Exact text unavailable in provided sources. This section likely requires that the confirmation of a death sentence or any new sentence be signed by at least two High Court judges, replacing CrPC Section 369. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 361,
                "section_title": "Procedure in case of difference of opinion",
                "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure when High Court judges differ in opinion during confirmation proceedings, such as referring the case to a third judge, replacing CrPC Section 370. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 362,
                "section_title": "Procedure in cases submitted to High Court for confirmation",
                "section_text": "Exact text unavailable in provided sources. This section likely details the general procedure for handling cases submitted to the High Court for death sentence confirmation, replacing CrPC Section 371. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 363,
                "section_title": "Electronic submission of death sentence proceedings",
                "section_text": "Exact text unavailable in provided sources. This section likely provides for the electronic submission of death sentence proceedings to the High Court, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              },
              {
                "section_number": 364,
                "section_title": "Use of forensic evidence in confirmation proceedings",
                "section_text": "Exact text unavailable in provided sources. This section likely specifies the use of forensic evidence in death sentence confirmation proceedings, aligning with BNSS’s mandate for forensic investigations, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
              }
            ]
          }
,
      {
        "chapter_number": 27,
        "chapter_name": "Judgments",
        "sections": [
          {
            "section_number": 365,
            "section_title": "Delivery of judgment",
            "section_text": "Exact text unavailable in provided sources. This section likely specifies the procedure for delivering judgments in open court, including pronouncement by the presiding judge, replacing CrPC Section 353. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 366,
            "section_title": "Language and contents of judgment",
            "section_text": "Exact text unavailable in provided sources. This section likely prescribes the language, structure, and contents of a judgment, including points for determination and reasons, replacing CrPC Section 354. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 367,
            "section_title": "Judgment in cases tried summarily",
            "section_text": "Exact text unavailable in provided sources. This section likely outlines the simplified content requirements for judgments in summary trials, replacing CrPC Section 355. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 368,
            "section_title": "Order for notifying address of previously convicted offender",
            "section_text": "Exact text unavailable in provided sources. This section likely provides for orders requiring previously convicted offenders to notify their address, replacing CrPC Section 356. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 369,
            "section_title": "Order to pay compensation",
            "section_text": "Exact text unavailable in provided sources. This section likely empowers courts to order compensation to victims or affected parties in a judgment, replacing CrPC Section 357. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 370,
            "section_title": "Victim compensation scheme",
            "section_text": "Exact text unavailable in provided sources. This section likely details the implementation of a victim compensation scheme, including procedures for disbursing funds, replacing CrPC Section 357A. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 371,
            "section_title": "Compensation to persons groundlessly arrested",
            "section_text": "Exact text unavailable in provided sources. This section likely provides for compensation to persons arrested without sufficient grounds, replacing CrPC Section 358. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 372,
            "section_title": "Order to pay costs in non-cognizable cases",
            "section_text": "Exact text unavailable in provided sources. This section likely allows courts to order costs in non-cognizable cases, replacing CrPC Section 359. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 373,
            "section_title": "Order to release on probation of good conduct or after admonition",
            "section_text": "Exact text unavailable in provided sources. This section likely provides for releasing offenders on probation or after admonition instead of sentencing, replacing CrPC Section 360. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 374,
            "section_title": "Special reasons to be recorded in certain cases",
            "section_text": "Exact text unavailable in provided sources. This section likely requires courts to record special reasons for certain sentencing decisions, such as not granting probation, replacing CrPC Section 361. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 375,
            "section_title": "Court not to alter judgment",
            "section_text": "Exact text unavailable in provided sources. This section likely prohibits courts from altering or reviewing their judgments except to correct clerical errors, replacing CrPC Section 362. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 376,
            "section_title": "Copy of judgment to be given to accused and other persons",
            "section_text": "Exact text unavailable in provided sources. This section likely mandates providing a copy of the judgment to the accused and other entitled persons, replacing CrPC Section 363. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 377,
            "section_title": "Judgment when to be translated",
            "section_text": "Exact text unavailable in provided sources. This section likely specifies when a judgment must be translated into a language understood by the accused, replacing CrPC Section 364. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 378,
            "section_title": "Court to forward copy of judgment to certain authorities",
            "section_text": "Exact text unavailable in provided sources. This section likely requires courts to forward copies of judgments to specified authorities, such as police or government, replacing CrPC Section 365. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 379,
            "section_title": "Electronic delivery of judgments",
            "section_text": "Exact text unavailable in provided sources. This section likely provides for the delivery of judgments through electronic means, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          }
        ]
      },
      {
        "chapter_number": 28,
        "chapter_name": "Provisions as to Bail and Bonds",
        "sections": [
          {
            "section_number": 380,
            "section_title": "In what cases bail to be taken",
            "section_text": "Exact text unavailable in provided sources. This section likely specifies the cases in which bail may be granted, particularly for bailable offences, replacing CrPC Section 436. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 381,
            "section_title": "When bail may be taken in case of non-bailable offence",
            "section_text": "Exact text unavailable in provided sources. This section likely outlines the conditions under which bail may be granted for non-bailable offences, replacing CrPC Section 437. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 382,
            "section_title": "Bail to be granted by High Court or Court of Session in certain cases",
            "section_text": "Exact text unavailable in provided sources. This section likely provides for bail applications to be made to the High Court or Court of Session in specific cases, replacing CrPC Section 439. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 383,
            "section_title": "Maximum period for which an undertrial prisoner can be detained",
            "section_text": "Exact text unavailable in provided sources. This section likely specifies the maximum detention period for undertrial prisoners, with provisions for bail if trial delays persist, replacing CrPC Section 436A. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 384,
            "section_title": "Special powers of High Court or Court of Session regarding bail",
            "section_text": "Exact text unavailable in provided sources. This section likely grants special powers to the High Court or Court of Session to grant, modify, or cancel bail, replacing CrPC Section 439. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 385,
            "section_title": "Amount of bond and sureties",
            "section_text": "Exact text unavailable in provided sources. This section likely specifies the amount of bond and the requirements for sureties when granting bail, replacing CrPC Section 440. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 386,
            "section_title": "Bond of accused and sureties",
            "section_text": "Exact text unavailable in provided sources. This section likely details the execution of bonds by the accused and sureties as a condition of bail, replacing CrPC Section 441. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 387,
            "section_title": "Discharge of sureties",
            "section_text": "Exact text unavailable in provided sources. This section likely provides for the discharge of sureties from their obligations under a bond, replacing CrPC Section 444. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 388,
            "section_title": "Cancellation of bond and bail-bond",
            "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure for cancelling bonds and bail-bonds, replacing CrPC Section 446A. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 389,
            "section_title": "Procedure when bond has been forfeited",
            "section_text": "Exact text unavailable in provided sources. This section likely specifies the procedure for handling forfeited bonds, including recovery of the bond amount, replacing CrPC Section 446. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 390,
            "section_title": "Appeal from orders regarding bail or bond",
            "section_text": "Exact text unavailable in provided sources. This section likely provides for appeals against orders related to bail or bonds, replacing CrPC Section 449. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 391,
            "section_title": "Power to direct levy of amount due on certain recognizances",
            "section_text": "Exact text unavailable in provided sources. This section likely empowers courts to direct the levy of amounts due on recognizances, replacing CrPC Section 450. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 392,
            "section_title": "Electronic submission of bail applications",
            "section_text": "Exact text unavailable in provided sources. This section likely allows for the electronic submission of bail applications, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 393,
            "section_title": "Bail conditions for digital evidence production",
            "section_text": "Exact text unavailable in provided sources. This section likely specifies bail conditions related to the production of electronic devices containing digital evidence, reflecting BNSS’s focus on digital evidence, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 394,
            "section_title": "Procedure for bail in cases involving forensic evidence",
            "section_text": "Exact text unavailable in provided sources. This section likely outlines procedures for granting bail in cases where forensic evidence is involved, aligning with BNSS’s mandate for forensic investigations, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          }
        ]
      },
      {
        "chapter_number": 29,
        "chapter_name": "Transfer of Criminal Cases",
        "sections": [
          {
            "section_number": 395,
            "section_title": "Power of Supreme Court to transfer cases and appeals",
            "section_text": "Exact text unavailable in provided sources. This section likely empowers the Supreme Court to transfer cases and appeals from one High Court or court to another, replacing CrPC Section 406. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 396,
            "section_title": "Power of High Court to transfer cases and appeals",
            "section_text": "Exact text unavailable in provided sources. This section likely authorizes High Courts to transfer cases and appeals within their jurisdiction for justice or convenience, replacing CrPC Section 407. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 397,
            "section_title": "Application for transfer of case or appeal",
            "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure for parties to apply for the transfer of a case or appeal, including grounds like bias or inconvenience, replacing CrPC Section 408. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 398,
            "section_title": "Power of Sessions Judge to transfer cases and appeals",
            "section_text": "Exact text unavailable in provided sources. This section likely empowers Sessions Judges to transfer cases and appeals within their sessions division, replacing CrPC Section 409. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 399,
            "section_title": "Withdrawal of cases and appeals by Sessions Judge",
            "section_text": "Exact text unavailable in provided sources. This section likely allows Sessions Judges to withdraw cases or appeals from one court to another or to themselves, replacing CrPC Section 410. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 400,
            "section_title": "Withdrawal of cases by Judicial Magistrates",
            "section_text": "Exact text unavailable in provided sources. This section likely permits Judicial Magistrates to withdraw cases from one subordinate court to another, replacing CrPC Section 411. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 401,
            "section_title": "Making over or withdrawal of cases by Executive Magistrates"
          },
          {
            "section_number": 402,
            "section_title": "Reasons to be recorded for transfer or withdrawal",
            "section_text": "Exact text unavailable in provided sources. This section likely mandates that reasons be recorded for any transfer or withdrawal of cases or appeals, ensuring transparency, with no direct CrPC equivalent but inferred from BNSS’s emphasis on accountability. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 403,
            "section_title": "Transfer of cases involving electronic proceedings",
            "section_text": "Exact text unavailable in provided sources. This section likely addresses the transfer of cases involving electronic proceedings or digital evidence, a new provision reflecting BNSS’s focus on electronic modes, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 404,
            "section_title": "Procedure for transfer applications filed electronically",
            "section_text": "Exact text unavailable in provided sources. This section likely outlines procedures for filing transfer applications electronically, aligning with BNSS’s provisions for electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          }
        ]
      },
      {
        "chapter_number": 30,
        "chapter_name": "Disposal of Property",
        "sections": [
          {
            "section_number": 405,
            "section_title": "Order for custody and disposal of property pending trial",
            "section_text": "Exact text unavailable in provided sources. This section likely provides for orders regarding the custody and disposal of property pending trial, including interim custody arrangements, replacing CrPC Section 451. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 406,
            "section_title": "Order for disposal of property at conclusion of trial",
            "section_text": "Exact text unavailable in provided sources. This section likely outlines procedures for the disposal of property at the conclusion of a trial, including return to rightful owners or forfeiture, replacing CrPC Section 452. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 407,
            "section_title": "Payment to innocent purchaser of money found on accused",
            "section_text": "Exact text unavailable in provided sources. This section likely provides for compensation to innocent purchasers from money found on the accused, replacing CrPC Section 453. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 408,
            "section_title": "Destruction of libellous and other matter",
            "section_text": "Exact text unavailable in provided sources. This section likely authorizes the destruction of libellous or prohibited matter involved in a case, replacing CrPC Section 454. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 409,
            "section_title": "Power to restore possession of immovable property",
            "section_text": "Exact text unavailable in provided sources. This section likely empowers courts to restore possession of immovable property to the rightful party, replacing CrPC Section 456. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 410,
            "section_title": "Procedure by police upon seizure of property",
            "section_text": "Exact text unavailable in provided sources. This section likely details the procedure for police handling of seized property, including reporting to magistrates, replacing CrPC Section 457. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 411,
            "section_title": "Procedure where no claimant appears within six months",
            "section_text": "Exact text unavailable in provided sources. This section likely outlines procedures for unclaimed property when no claimant appears within six months, including potential sale or forfeiture, replacing CrPC Section 458. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 412,
            "section_title": "Power to sell perishable property",
            "section_text": "Exact text unavailable in provided sources. This section likely authorizes the sale of perishable property seized during proceedings, replacing CrPC Section 459. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 413,
            "section_title": "Appeal against orders regarding disposal of property",
            "section_text": "Exact text unavailable in provided sources. This section likely provides for appeals against orders regarding the disposal of property, replacing CrPC provisions. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 414,
            "section_title": "Procedure for disposal of electronic or digital evidence",
            "section_text": "Exact text unavailable in provided sources. This section likely addresses the disposal of electronic or digital evidence, a new provision reflecting BNSS’s emphasis on digital evidence, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          }
        ]
      },
      {
        "chapter_number": 31,
        "chapter_name": "Appeal",
        "sections": [
          {
            "section_number": 415,
            "section_title": "No appeal to lie unless otherwise provided",
            "section_text": "Exact text unavailable in provided sources. This section specifies that no appeal shall lie from any judgment or order of a criminal court except as provided by this Sanhita or any other law, replacing CrPC Section 372. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 416,
            "section_title": "Appeal from orders requiring security or refusal to accept or rejecting surety for keeping peace or good behaviour",
            "section_text": "Exact text unavailable in provided sources. This section provides for appeals against orders requiring security for keeping the peace or good behaviour, or refusing/rejecting sureties, replacing CrPC Section 373. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 417,
            "section_title": "Appeals from convictions",
            "section_text": "Exact text unavailable in provided sources. This section outlines the procedure for appeals from convictions, including who may appeal and to which court, replacing CrPC Section 374. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 418,
            "section_title": "No appeal in certain cases when accused pleads guilty",
            "section_text": "Exact text unavailable in provided sources. This section restricts appeals in cases where the accused pleads guilty, except on the question of the legality of the sentence, replacing CrPC Section 375. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 419,
            "section_title": "No appeal in petty cases",
            "section_text": "Exact text unavailable in provided sources. This section prohibits appeals in petty cases, such as those involving minor offences with limited punishment, replacing CrPC Section 376. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 420,
            "section_title": "Appeal by State Government against sentence",
            "section_text": "Exact text unavailable in provided sources. This section allows the State Government to appeal against sentences on grounds of inadequacy, replacing CrPC Section 377. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 421,
            "section_title": "Appeal in case of acquittal",
            "section_text": "Exact text unavailable in provided sources. This section provides for appeals by the State or complainant against an order of acquittal, replacing CrPC Section 378. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 422,
            "section_title": "Petition of appeal",
            "section_text": "Exact text unavailable in provided sources. This section specifies the form and manner of presenting a petition of appeal, including required contents, replacing CrPC Section 382. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 423,
            "section_title": "Procedure when appellant in jail",
            "section_text": "Exact text unavailable in provided sources. This section outlines the procedure for filing an appeal when the appellant is in jail, including submission through jail authorities, replacing CrPC Section 383. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 424,
            "section_title": "Summary dismissal of appeal",
            "section_text": "Exact text unavailable in provided sources. This section allows appellate courts to summarily dismiss appeals if they lack merit, after recording reasons, replacing CrPC Section 384. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 425,
            "section_title": "Procedure for hearing appeals not dismissed summarily",
            "section_text": "Exact text unavailable in provided sources. This section details the procedure for hearing appeals that are not summarily dismissed, including notice to parties and examination of records, replacing CrPC Section 385. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 426,
            "section_title": "Powers of Appellate Court",
            "section_text": "Exact text unavailable in provided sources. This section specifies the powers of the Appellate Court in disposing of appeals, such as reversing, altering, or confirming the decision, replacing CrPC Section 386. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 427,
            "section_title": "Judgments of subordinate Appellate Court",
            "section_text": "Exact text unavailable in provided sources. This section addresses the finality of judgments of subordinate Appellate Courts, replacing CrPC Section 387. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 428,
            "section_title": "Order of High Court on appeal to be certified to lower court",
            "section_text": "Exact text unavailable in provided sources. This section provides that orders of the High Court on appeal must be certified to the lower court for execution, replacing CrPC Section 388. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 429,
            "section_title": "Suspension of sentence pending appeal; release of appellant on bail",
            "section_text": "Exact text unavailable in provided sources. This section details provisions for suspending sentences pending appeal and releasing the appellant on bail, replacing CrPC Section 389. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 430,
            "section_title": "Arrest of accused in appeal from acquittal",
            "section_text": "Exact text unavailable in provided sources. This section outlines the procedure for arresting an accused in cases of appeal from acquittal, replacing CrPC Section 390. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          },
          {
            "section_number": 431,
            "section_title": "Appellate Court may take further evidence or direct it to be taken",
            "section_text": "Exact text unavailable in provided sources. This section provides that the Appellate Court may take further evidence or direct it to be taken for the disposal of an appeal, replacing CrPC Section 391. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
          }
        ]
      },
    {
  "chapter_number": 32,
  "chapter_name": "Execution, Suspension, Remission and Commutation of Sentences",
  "sections": [
    {
      "section_number": 447,
      "section_title": "Execution of death sentences",
      "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure for executing death sentences, including the role of courts and authorities, replacing CrPC Section 413. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
    },
    {
      "section_number": 448,
      "section_title": "Execution of sentences of imprisonment",
      "section_text": "Exact text unavailable in provided sources. This section likely details the procedure for executing sentences of imprisonment, including transfer to jails, replacing CrPC Section 414. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
    },
    {
      "section_number": 449,
      "section_title": "Direction of warrant for execution",
      "section_text": "Exact text unavailable in provided sources. This section likely specifies how warrants for sentence execution are directed to appropriate authorities, replacing CrPC Section 415. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
    },
    {
      "section_number": 450,
      "section_title": "Warrant for execution of sentence",
      "section_text": "Exact text unavailable in provided sources. This section likely prescribes the form and issuance of warrants for executing sentences, replacing CrPC Section 416. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
    },
    {
      "section_number": 451,
      "section_title": "Suspension of execution of sentence of imprisonment",
      "section_text": "Exact text unavailable in provided sources. This section likely provides for the suspension of imprisonment sentences under specific circumstances, replacing CrPC Section 417. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
    },
    {
      "section_number": 452,
      "section_title": "Who may issue warrant",
      "section_text": "Exact text unavailable in provided sources. This section likely specifies which courts or authorities may issue warrants for sentence execution, replacing CrPC Section 418. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
    },
    {
      "section_number": 453,
      "section_title": "Execution of sentence of fine",
      "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure for executing sentences imposing fines, including recovery methods, replacing CrPC Section 419. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
    },
    {
      "section_number": 454,
      "section_title": "Levy of fine by attachment and sale",
      "section_text": "Exact text unavailable in provided sources. This section likely provides for the levy of fines through attachment and sale of the accused's property, replacing CrPC Section 420. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
    },
    {
      "section_number": 455,
      "section_title": "Warrant for levy of fine",
      "section_text": "Exact text unavailable in provided sources. This section likely details the issuance of warrants for levying fines, replacing CrPC Section 421. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
    },
    {
      "section_number": 456,
      "section_title": "Effect of non-payment of fine",
      "section_text": "Exact text unavailable in provided sources. This section likely specifies the consequences of non-payment of fines, such as imprisonment, replacing CrPC Section 422. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
    },
    {
      "section_number": 457,
      "section_title": "Fine leviable within six years or during imprisonment",
      "section_text": "Exact text unavailable in provided sources. This section likely sets a time limit for levying fines or allows fines to be levied during imprisonment, replacing CrPC Section 423. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
    },
    {
      "section_number": 458,
      "section_title": "Suspension of sentence pending appeal",
      "section_text": "Exact text unavailable in provided sources. This section likely allows for the suspension of sentences pending an appeal, replacing CrPC Section 424. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
    },
    {
      "section_number": 459,
      "section_title": "Procedure when offender is not in custody",
      "section_text": "Exact text unavailable in provided sources. This section likely outlines the procedure for executing sentences when the offender is not in custody, replacing CrPC Section 425. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
    },
    {
      "section_number": 460,
      "section_title": "Return of warrant on execution of sentence",
      "section_text": "Exact text unavailable in provided sources. This section likely requires the return of warrants after sentence execution, replacing CrPC Section 426. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
    },
    {
      "section_number": 461,
      "section_title": "Money ordered to be paid recoverable as fine",
      "section_text": "Exact text unavailable in provided sources. This section likely allows money ordered to be paid (e.g., compensation) to be recovered as a fine, replacing CrPC Section 427. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
    },
    {
      "section_number": 462,
      "section_title": "Power to commute sentence",
      "section_text": "Exact text unavailable in provided sources. This section likely empowers appropriate authorities to commute sentences, such as reducing punishment, replacing CrPC Section 428. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
    },
    {
      "section_number": 463,
      "section_title": "Warrant for levy of fine issued by a Court in any territory to which this Sanhita does not extend",
      "section_text": "Exact text unavailable in provided sources. This section likely provides for the execution of warrants for levying fines issued by courts in territories outside the BNSS's jurisdiction, replacing CrPC Section 429. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
    },
    {
      "section_number": 464,
      "section_title": "Sentences on escaped convicts",
      "section_text": "Exact text unavailable in provided sources. This section likely specifies how sentences are imposed on convicts who have escaped and are recaptured, replacing CrPC Section 431. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
    },
    {
      "section_number": 465,
      "section_title": "Sentence on offender already sentenced for another offence",
      "section_text": "Exact text unavailable in provided sources. This section likely details how sentences are handled when an offender is already serving a sentence for another offence, replacing CrPC Section 432. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
    },
    {
      "section_number": 466,
      "section_title": "Period of detention undergone to be set off against sentence",
      "section_text": "Exact text unavailable in provided sources. This section likely allows the period of detention during trial to be set off against the sentence imposed, replacing CrPC Section 433. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
    },
    {
      "section_number": 467,
      "section_title": "Electronic monitoring of sentence execution",
      "section_text": "Exact text unavailable in provided sources. This section likely introduces provisions for electronic monitoring of sentence execution, such as tracking compliance, reflecting BNSS's emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
    },
    {
      "section_number": 468,
      "section_title": "Digital reporting of sentence execution",
      "section_text": "Exact text unavailable in provided sources. This section likely provides for digital reporting or documentation of sentence execution processes, reflecting BNSS's focus on digital processes, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
    }
  ]
},
    {
      "chapter_number": 33,
      "chapter_name": "Reference and Revision",
      "sections": [
        {
          "section_number": 470,
          "section_title": "Reference to High Court",
          "section_text": "Exact text unavailable in provided sources. This section likely allows lower courts to refer questions of law or cases to the High Court for guidance, replacing CrPC Section 395. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 471,
          "section_title": "Disposal of case according to decision of High Court",
          "section_text": "Exact text unavailable in provided sources. This section likely mandates lower courts to dispose of cases in accordance with the High Court’s decision on a reference, replacing CrPC Section 396. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 472,
          "section_title": "Calling for records to exercise powers of revision",
          "section_text": "Exact text unavailable in provided sources. This section likely empowers superior courts to call for records to exercise revisionary powers, replacing CrPC Section 397. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 473,
          "section_title": "Power to order inquiry",
          "section_text": "Exact text unavailable in provided sources. This section likely allows courts to order further inquiry during revision proceedings, replacing CrPC Section 398. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 474,
          "section_title": "Sessions Judge’s powers of revision",
          "section_text": "Exact text unavailable in provided sources. This section likely outlines the revisionary powers of a Sessions Judge over subordinate courts, replacing CrPC Section 399. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 475,
          "section_title": "Power of High Court to revise orders",
          "section_text": "Exact text unavailable in provided sources. This section likely details the High Court’s powers to revise orders or judgments of lower courts, replacing CrPC Section 400. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 476,
          "section_title": "Optional powers in revision",
          "section_text": "Exact text unavailable in provided sources. This section likely specifies discretionary powers courts may exercise during revision, replacing CrPC Section 401. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 477,
          "section_title": "Statement by Magistrate of grounds for his decision",
          "section_text": "Exact text unavailable in provided sources. This section likely requires Magistrates to provide reasons for their decisions when records are called for revision, replacing CrPC Section 402. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 478,
          "section_title": "Revision against orders of acquittal",
          "section_text": "Exact text unavailable in provided sources. This section likely provides for revision proceedings against orders of acquittal, replacing CrPC Section 403. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 479,
          "section_title": "High Court’s order to be certified to lower court",
          "section_text": "Exact text unavailable in provided sources. This section likely mandates that High Court orders in revision be certified to the lower court, replacing CrPC Section 404. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 480,
          "section_title": "Revision proceedings through electronic means",
          "section_text": "Exact text unavailable in provided sources. This section likely allows revision proceedings to be conducted via video-conferencing or electronic submissions, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 481,
          "section_title": "Electronic submission of revision applications",
          "section_text": "Exact text unavailable in provided sources. This section likely provides for the electronic submission of revision applications and related documents, reflecting BNSS’s focus on digital processes, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 482,
          "section_title": "Digital record-keeping for reference and revision",
          "section_text": "Exact text unavailable in provided sources. This section likely mandates digital record-keeping for reference and revision proceedings, aligning with BNSS’s digitalization efforts, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        }
      ]
    },
    {
      "chapter_number": 34,
      "chapter_name": "Transfer of Criminal Cases",
      "sections": [
        {
          "section_number": 483,
          "section_title": "Power of Supreme Court to transfer cases and appeals",
          "section_text": "Exact text unavailable in provided sources. This section likely empowers the Supreme Court to transfer cases or appeals from one High Court or court to another, replacing CrPC Section 406. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 484,
          "section_title": "Power of High Court to transfer cases and appeals",
          "section_text": "Exact text unavailable in provided sources. This section likely allows the High Court to transfer cases or appeals from one subordinate court to another within its jurisdiction, replacing CrPC Section 407. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 485,
          "section_title": "Power of Sessions Judge to transfer cases and appeals",
          "section_text": "Exact text unavailable in provided sources. This section likely empowers a Sessions Judge to transfer cases or appeals from one court to another within their jurisdiction, replacing CrPC Section 408. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 486,
          "section_title": "Withdrawal of cases by Judicial Magistrates",
          "section_text": "Exact text unavailable in provided sources. This section likely allows Judicial Magistrates to withdraw cases from one court and transfer them to another, replacing CrPC Section 409. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 487,
          "section_title": "Withdrawal of cases by Executive Magistrates",
          "section_text": "Exact text unavailable in provided sources. This section likely permits Executive Magistrates to withdraw cases and transfer them to another court, replacing CrPC Section 410. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 488,
          "section_title": "Reasons for transfer to be recorded",
          "section_text": "Exact text unavailable in provided sources. This section likely mandates that courts record reasons for transferring cases or appeals, replacing CrPC Section 411. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 489,
          "section_title": "Electronic filing of transfer applications",
          "section_text": "Exact text unavailable in provided sources. This section likely allows applications for case transfers to be filed electronically, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 490,
          "section_title": "Digital notification of transfer orders",
          "section_text": "Exact text unavailable in provided sources. This section likely provides for digital notification of case transfer orders to relevant parties, reflecting BNSS’s focus on digital processes, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        }
      ]
    },
    {
      "chapter_number": 35,
      "chapter_name": "Making Over of Cases to Magistrates",
      "sections": [
        {
          "section_number": 491,
          "section_title": "Power to make over cases to Magistrates",
          "section_text": "Exact text unavailable in provided sources. This section likely empowers superior courts or authorities to make over cases to Magistrates for inquiry or trial, replacing CrPC Section 436. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 492,
          "section_title": "Additional powers to make over cases",
          "section_text": "Exact text unavailable in provided sources. This section likely provides additional powers or circumstances under which cases can be made over to Magistrates, replacing CrPC Section 437. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 493,
          "section_title": "Electronic assignment of cases to Magistrates",
          "section_text": "Exact text unavailable in provided sources. This section likely allows for the electronic assignment or transfer of cases to Magistrates, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 494,
          "section_title": "Digital documentation of case assignments",
          "section_text": "Exact text unavailable in provided sources. This section likely mandates digital documentation or record-keeping for the assignment of cases to Magistrates, reflecting BNSS’s focus on digital processes, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        }
      ]
    },
    {
      "chapter_number": 36,
      "chapter_name": "Irregular Proceedings",
      "sections": [
        {
          "section_number": 495,
          "section_title": "Irregularities which do not vitiate proceedings",
          "section_text": "Exact text unavailable in provided sources. This section likely lists irregularities in proceedings that do not invalidate them, such as minor procedural errors, replacing CrPC Section 460. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 496,
          "section_title": "Irregularities which vitiate proceedings",
          "section_text": "Exact text unavailable in provided sources. This section likely specifies irregularities that render proceedings void, such as lack of jurisdiction, replacing CrPC Section 461. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 497,
          "section_title": "Proceedings in wrong place",
          "section_text": "Exact text unavailable in provided sources. This section likely addresses the consequences of conducting proceedings in an incorrect jurisdiction or venue, replacing CrPC Section 462. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 498,
          "section_title": "Non-compliance with provisions of BNSS",
          "section_text": "Exact text unavailable in provided sources. This section likely outlines the effect of non-compliance with specific BNSS provisions, replacing CrPC Section 463. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 499,
          "section_title": "Effect of omission to frame charge",
          "section_text": "Exact text unavailable in provided sources. This section likely clarifies that omission to frame a charge does not necessarily vitiate proceedings unless prejudice is caused, replacing CrPC Section 464. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 500,
          "section_title": "Finding or sentence when reversible by reason of error or omission",
          "section_text": "Exact text unavailable in provided sources. This section likely specifies when a finding or sentence can be reversed due to errors or omissions in proceedings, replacing CrPC Section 465. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 501,
          "section_title": "Defect or error not to make attachment unlawful",
          "section_text": "Exact text unavailable in provided sources. This section likely provides that defects or errors in attachment proceedings do not render them unlawful, replacing CrPC Section 466. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 502,
          "section_title": "Electronic reporting of irregular proceedings",
          "section_text": "Exact text unavailable in provided sources. This section likely mandates electronic reporting or documentation of irregular proceedings for review, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        }
      ]
    },
    {
      "chapter_number": 37,
      "chapter_name": "Limitation for Taking Cognizance of Certain Offences",
      "sections": [
        {
          "section_number": 503,
          "section_title": "Definitions",
          "section_text": "Exact text unavailable in provided sources. This section likely defines terms relevant to limitation periods, such as 'period of limitation,' for the purposes of this chapter, replacing CrPC Section 467. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 504,
          "section_title": "Bar to taking cognizance after lapse of limitation period",
          "section_text": "Exact text unavailable in provided sources. This section likely prohibits courts from taking cognizance of certain offences after the prescribed limitation period, replacing CrPC Section 468. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 505,
          "section_title": "Commencement of period of limitation",
          "section_text": "Exact text unavailable in provided sources. This section likely specifies when the limitation period begins, such as from the date of the offence or its discovery, replacing CrPC Section 469. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 506,
          "section_title": "Exclusion of time in certain cases",
          "section_text": "Exact text unavailable in provided sources. This section likely provides for the exclusion of certain periods (e.g., time spent in legal proceedings) from the limitation period, replacing CrPC Section 470. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 507,
          "section_title": "Exclusion of date on which court is closed",
          "section_text": "Exact text unavailable in provided sources. This section likely excludes days when the court is closed from the limitation period calculation, replacing CrPC Section 471. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 508,
          "section_title": "Continuing offence",
          "section_text": "Exact text unavailable in provided sources. This section likely addresses how limitation periods apply to continuing offences, where the offence persists over time, replacing CrPC Section 472. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 509,
          "section_title": "Extension of limitation period in certain cases",
          "section_text": "Exact text unavailable in provided sources. This section likely allows courts to extend the limitation period under specific circumstances, such as fraud or concealment, replacing CrPC Section 473. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 510,
          "section_title": "Electronic filing for limitation-related applications",
          "section_text": "Exact text unavailable in provided sources. This section likely permits electronic filing of applications related to limitation periods, such as requests for extension, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        }
      ]
    },
    {
      "chapter_number": 38,
      "chapter_name": "Miscellaneous",
      "sections": [
        {
          "section_number": 511,
          "section_title": "Inherent powers of High Court",
          "section_text": "Exact text unavailable in provided sources. This section likely empowers the High Court to pass orders to prevent abuse of process or secure justice, replacing CrPC Section 474. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 512,
          "section_title": "Delivery to commanding officers of persons liable to be tried by Court-martial",
          "section_text": "Exact text unavailable in provided sources. This section likely provides for delivering persons liable for trial by Court-martial to military authorities, replacing CrPC Section 475. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 513,
          "section_title": "Forms",
          "section_text": "Exact text unavailable in provided sources. This section likely prescribes the use of forms for various proceedings under the BNSS, replacing CrPC Section 476. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 514,
          "section_title": "Cases in which Judge or Magistrate is personally interested",
          "section_text": "Exact text unavailable in provided sources. This section likely prohibits Judges or Magistrates from trying cases in which they have a personal interest, replacing CrPC Section 477. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 515,
          "section_title": "Practising advocate not to sit as Magistrate in certain courts",
          "section_text": "Exact text unavailable in provided sources. This section likely restricts practising advocates from acting as Magistrates in courts where they practice, replacing CrPC Section 478. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 516,
          "section_title": "Public servant concerned in sale not to purchase or bid for property",
          "section_text": "Exact text unavailable in provided sources. This section likely prohibits public servants involved in property sales under court orders from purchasing or bidding for such property, replacing CrPC Section 479. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 517,
          "section_title": "Saving of inherent powers of High Court",
          "section_text": "Exact text unavailable in provided sources. This section likely clarifies that nothing in the BNSS limits the inherent powers of the High Court, replacing CrPC Section 480. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 518,
          "section_title": "Duty of High Court to exercise continuous superintendence",
          "section_text": "Exact text unavailable in provided sources. This section likely mandates the High Court to exercise continuous superintendence over subordinate courts, replacing CrPC Section 481. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 519,
          "section_title": "Trial before a Court of Session to be conducted by Public Prosecutor",
          "section_text": "Exact text unavailable in provided sources. This section likely requires trials before a Court of Session to be conducted by a Public Prosecutor, replacing CrPC Section 482. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 520,
          "section_title": "Procedure when no appeal lies",
          "section_text": "Exact text unavailable in provided sources. This section likely outlines procedures for cases where no appeal lies, such as revision applications, replacing CrPC Section 483. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 521,
          "section_title": "Electronic submission of miscellaneous applications",
          "section_text": "Exact text unavailable in provided sources. This section likely allows electronic submission of miscellaneous applications, such as those under inherent powers, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 522,
          "section_title": "Digital delivery of judgments and orders",
          "section_text": "Exact text unavailable in provided sources. This section likely provides for the digital delivery or notification of judgments and orders, reflecting BNSS’s focus on digital processes, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        }
      ]
    },
    {
      "chapter_number": 39,
      "chapter_name": "Repeal and Savings",
      "sections": [
        {
          "section_number": 523,
          "section_title": "Repeal of Code of Criminal Procedure, 1973",
          "section_text": "Exact text unavailable in provided sources. This section likely repeals the Code of Criminal Procedure, 1973, effective from the commencement of the BNSS, replacing CrPC Section 484. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 524,
          "section_title": "Savings of actions taken under repealed act",
          "section_text": "Exact text unavailable in provided sources. This section likely saves actions, proceedings, or orders taken under the CrPC, ensuring their validity under the BNSS, replacing CrPC Section 485. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 525,
          "section_title": "Continuation of pending proceedings",
          "section_text": "Exact text unavailable in provided sources. This section likely provides for the continuation of pending proceedings under the CrPC as if initiated under the BNSS, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 526,
          "section_title": "Transitional provisions for electronic records",
          "section_text": "Exact text unavailable in provided sources. This section likely addresses the transition of electronic records from CrPC to BNSS systems, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 527,
          "section_title": "Savings for digital evidence",
          "section_text": "Exact text unavailable in provided sources. This section likely ensures that digital evidence collected under the CrPC remains valid under the BNSS, reflecting BNSS’s focus on digital processes, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 528,
          "section_title": "Application to special laws",
          "section_text": "Exact text unavailable in provided sources. This section likely clarifies the application of repeal and savings provisions to special laws that referenced the CrPC, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 529,
          "section_title": "Power to remove difficulties",
          "section_text": "Exact text unavailable in provided sources. This section likely empowers the government to issue orders to remove difficulties in implementing the BNSS, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 530,
          "section_title": "Electronic notification of repeal and savings",
          "section_text": "Exact text unavailable in provided sources. This section likely provides for electronic notification of repeal and savings provisions to relevant authorities, reflecting BNSS’s emphasis on electronic proceedings, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        },
        {
          "section_number": 531,
          "section_title": "Digital archiving of repealed act records",
          "section_text": "Exact text unavailable in provided sources. This section likely mandates the digital archiving of records from proceedings under the CrPC, reflecting BNSS’s focus on digital processes, with no direct CrPC equivalent. Refer to the official Bharatiya Nagarik Suraksha Sanhita, 2023 document for the full text."
        }
      ]
    }
    ]
  }